[
  {
    "word": "abate",
    "definition": "to reduce, lessen",
    "sentence": "The storm refused to abate, so our picnic turned into an indoor floor-sandwich situation."
  },
  {
    "word": "abbreviate",
    "definition": "to shorten or condense",
    "sentence": "My teacher asked me to abbreviate my twenty-page essay, so I cut it down to nineteen and called it progress."
  },
  {
    "word": "aberrant",
    "definition": "departing from the normal or expected",
    "sentence": "Finding a penguin in the desert would be pretty aberrant, even for a nature documentary gone wrong."
  },
  {
    "word": "aberration",
    "definition": "something that differs from the norm",
    "sentence": "Getting an A in gym class was such an aberration that my mom framed the report card."
  },
  {
    "word": "abet",
    "definition": "to aid, help, encourage",
    "sentence": "My dog abetted my little brother's cookie heist by distracting me with an aggressive tail wag."
  },
  {
    "word": "abhor",
    "definition": "to hate, detest",
    "sentence": "I abhor waking up early so much that my alarm clock and I are no longer on speaking terms."
  },
  {
    "word": "abide",
    "definition": "to put up with; to remain",
    "sentence": "I can abide most things, but pineapple on pizza is where I draw the line."
  },
  {
    "word": "abject",
    "definition": "wretched, pitiful",
    "sentence": "After burning dinner for the third time, I sat in abject defeat staring at the smoke detector."
  },
  {
    "word": "abnegation",
    "definition": "denial of comfort to oneself",
    "sentence": "Her abnegation of dessert lasted exactly four minutes before the brownies called her name."
  },
  {
    "word": "abolish",
    "definition": "to formally put an end to",
    "sentence": "If I could abolish one thing, it would be the existence of Monday mornings."
  },
  {
    "word": "abominable",
    "definition": "extremely unpleasant; causing disgust",
    "sentence": "The cafeteria's mystery meat was so abominable that even the flies avoided it."
  },
  {
    "word": "aboriginal",
    "definition": "inhabiting a land from the earliest times",
    "sentence": "The aboriginal peoples of Australia developed sophisticated techniques for surviving the harsh outback."
  },
  {
    "word": "abortive",
    "definition": "failing to achieve the intended result",
    "sentence": "His abortive attempt to cook Thanksgiving dinner ended with the fire department on speed dial."
  },
  {
    "word": "abridge",
    "definition": "to cut down, shorten; shortened",
    "sentence": "They abridged the four-hour movie into a two-hour version, and honestly, nobody missed the subplot about the goat."
  },
  {
    "word": "abrogate",
    "definition": "to abolish, usually by authority",
    "sentence": "The principal abrogated the no-phone rule during the field trip, and chaos immediately followed."
  },
  {
    "word": "abrupt",
    "definition": "sudden and unexpected",
    "sentence": "The movie's abrupt ending left everyone in the theater yelling at the screen."
  },
  {
    "word": "abscission",
    "definition": "the natural cutting off or separation",
    "sentence": "In autumn, abscission causes leaves to fall, giving trees their annual dramatic costume change."
  },
  {
    "word": "absolve",
    "definition": "to declare free from guilt or blame",
    "sentence": "The cat's adorable face absolved her of all guilt for knocking the vase off the shelf."
  },
  {
    "word": "abstain",
    "definition": "to freely choose not to commit an action",
    "sentence": "I tried to abstain from snacking, but the chips in the pantry were basically screaming my name."
  },
  {
    "word": "abstemious",
    "definition": "moderate and restrained in eating and drinking",
    "sentence": "My abstemious grandmother eats one small portion and then watches the rest of us stuff ourselves."
  },
  {
    "word": "abstract",
    "definition": "existing in thought rather than having physical form",
    "sentence": "His painting was so abstract that people couldn't tell if it was a horse or a filing cabinet."
  },
  {
    "word": "abstruse",
    "definition": "hard to comprehend",
    "sentence": "The professor's explanation was so abstruse that even the smartest student just nodded and Googled it later."
  },
  {
    "word": "abundance",
    "definition": "a very large quantity of something",
    "sentence": "There was such an abundance of pizza at the party that we ate it for breakfast, lunch, and dinner the next day."
  },
  {
    "word": "abundant",
    "definition": "existing in great quantity; plentiful",
    "sentence": "Squirrels were so abundant in the park that you couldn't take a step without tripping over one."
  },
  {
    "word": "abusive",
    "definition": "extremely offensive and insulting",
    "sentence": "The coach's abusive yelling made everyone on the team dread practice."
  },
  {
    "word": "accede",
    "definition": "to agree",
    "sentence": "After an hour of begging, my parents finally acceded to letting me adopt the stray kitten."
  },
  {
    "word": "accelerate",
    "definition": "to increase in speed or rate",
    "sentence": "The car began to accelerate so fast that my cheeks literally flattened against my skull."
  },
  {
    "word": "accentuate",
    "definition": "to stress, highlight",
    "sentence": "The bright red scarf accentuated her outfit so perfectly it looked like a magazine cover."
  },
  {
    "word": "accessible",
    "definition": "obtainable, reachable",
    "sentence": "The new ramp made the library accessible to everyone, including my grandpa and his speedy wheelchair."
  },
  {
    "word": "acclaim",
    "definition": "high praise",
    "sentence": "The young chef received so much acclaim for her pasta that she opened a restaurant at age sixteen."
  },
  {
    "word": "acclimate",
    "definition": "to become accustomed to a new environment",
    "sentence": "It took me a full month to acclimate to the cold after moving from Florida to Minnesota."
  },
  {
    "word": "accolade",
    "definition": "high praise, special distinction",
    "sentence": "Winning the science fair was the biggest accolade of his middle school career."
  },
  {
    "word": "accommodate",
    "definition": "to provide lodging or adjust to fit",
    "sentence": "The tiny apartment could barely accommodate two people, let alone three cats and a tuba."
  },
  {
    "word": "accomplice",
    "definition": "a partner in committing a crime",
    "sentence": "My sister was my accomplice in sneaking cookies from the jar while Mom was on the phone."
  },
  {
    "word": "accomplish",
    "definition": "to achieve or complete successfully",
    "sentence": "She managed to accomplish in one afternoon what the rest of us couldn't do in a week."
  },
  {
    "word": "accord",
    "definition": "an agreement",
    "sentence": "The two rival clubs reached an accord to share the gym on alternate Tuesdays."
  },
  {
    "word": "accost",
    "definition": "to confront verbally",
    "sentence": "A stranger accosted me on the street to ask if I'd heard about his sandwich shop."
  },
  {
    "word": "accrue",
    "definition": "to accumulate or receive over time",
    "sentence": "Interest continues to accrue in a savings account, so your money slowly grows while you sleep."
  },
  {
    "word": "acerbic",
    "definition": "biting, bitter in tone or taste",
    "sentence": "Her acerbic review of the restaurant mentioned that the salad tasted like 'angry lettuce.'"
  },
  {
    "word": "acetic",
    "definition": "relating to or containing vinegar or acid",
    "sentence": "The acetic smell of vinegar filled the kitchen when she started making her famous pickles."
  },
  {
    "word": "ache",
    "definition": "a continuous dull pain",
    "sentence": "After running my first marathon, every muscle in my body seemed to ache in protest."
  },
  {
    "word": "achieve",
    "definition": "to successfully reach a goal through effort",
    "sentence": "She worked late every night to achieve her goal of graduating at the top of her class."
  },
  {
    "word": "acidic",
    "definition": "having a sharp, sour quality; low pH",
    "sentence": "The lemonade was so acidic it made my face scrunch up like a raisin."
  },
  {
    "word": "acknowledge",
    "definition": "to accept or recognize as true",
    "sentence": "He refused to acknowledge his mistake, even when the evidence was literally taped to his forehead."
  },
  {
    "word": "acme",
    "definition": "the highest point or peak of achievement",
    "sentence": "Winning the national championship was the acme of her athletic career."
  },
  {
    "word": "acolyte",
    "definition": "a devoted follower or assistant",
    "sentence": "As a devoted acolyte of the famous chef, she memorized every recipe in his cookbook."
  },
  {
    "word": "acquiesce",
    "definition": "to agree without protesting",
    "sentence": "I eventually acquiesced to my friend's plan, mostly because arguing with her is like arguing with a wall."
  },
  {
    "word": "acquit",
    "definition": "to declare not guilty of a crime",
    "sentence": "The jury acquitted the defendant after the evidence proved he was in another state that day."
  },
  {
    "word": "acrimony",
    "definition": "bitterness, discord",
    "sentence": "The acrimony between the two neighbors over the fence height lasted an impressive twelve years."
  },
  {
    "word": "acrophobia",
    "definition": "an extreme fear of heights",
    "sentence": "His acrophobia was so intense that even standing on a step stool made him dizzy."
  },
  {
    "word": "actuate",
    "definition": "to cause to act or move",
    "sentence": "Curiosity actuated her decision to open the mysterious locked box in the attic."
  },
  {
    "word": "acute",
    "definition": "sharp, severe; having keen insight",
    "sentence": "She had an acute sense of hearing and could detect a whispered secret from across the room."
  },
  {
    "word": "adamant",
    "definition": "impervious, immovable, unyielding",
    "sentence": "He was adamant about not eating broccoli, even when it was disguised under a mountain of cheese."
  },
  {
    "word": "adapt",
    "definition": "to adjust to new conditions",
    "sentence": "Chameleons adapt to their surroundings by changing color, which is honestly a superpower I'd love to have."
  },
  {
    "word": "addendum",
    "definition": "an addition or supplement to a document",
    "sentence": "The teacher added an addendum to the syllabus that said 'No, you may not write your essay in crayon.'"
  },
  {
    "word": "addict",
    "definition": "a person dependent on a substance or habit",
    "sentence": "She was such a coffee addict that her veins probably ran on espresso."
  },
  {
    "word": "additive",
    "definition": "a substance added to improve or preserve",
    "sentence": "The food additive gave the candy its neon green color and vaguely radioactive glow."
  },
  {
    "word": "address",
    "definition": "to speak to or deal with a matter",
    "sentence": "The principal stood up to address the students about the mysterious pudding incident."
  },
  {
    "word": "adept",
    "definition": "extremely skilled",
    "sentence": "She was adept at juggling five conversations at once without losing track of any of them."
  },
  {
    "word": "adhere",
    "definition": "to stick to something; to follow devoutly",
    "sentence": "Please adhere to the posted speed limit, or the speed camera will send you a very expensive photo."
  },
  {
    "word": "adherent",
    "definition": "a supporter of a particular cause or belief",
    "sentence": "As a loyal adherent of the zero-waste movement, she brought reusable everything to lunch."
  },
  {
    "word": "adjacent",
    "definition": "next to or near something",
    "sentence": "The houses were adjacent, separated only by a fence and decades of passive-aggressive gardening."
  },
  {
    "word": "adjoin",
    "definition": "to be next to and share a boundary",
    "sentence": "Our hotel room adjoined the pool, which was great until the midnight cannonball competitions started."
  },
  {
    "word": "adjudicate",
    "definition": "to make a formal judgment on a dispute",
    "sentence": "The judge was brought in to adjudicate the heated dispute over who invented the best cookie recipe."
  },
  {
    "word": "adjunct",
    "definition": "something added but not essential",
    "sentence": "The small café served as an adjunct to the bookstore, giving readers a place to sip while they read."
  },
  {
    "word": "administer",
    "definition": "to manage, direct, or give out",
    "sentence": "The nurse gently administered the vaccine while I looked away and thought about tacos."
  },
  {
    "word": "admirable",
    "definition": "deserving of respect and approval",
    "sentence": "Her admirable patience allowed her to teach a room full of five-year-olds without losing her mind."
  },
  {
    "word": "admiration",
    "definition": "a feeling of respect and warm approval",
    "sentence": "He gazed at the painting with such admiration that the security guard thought he was planning a heist."
  },
  {
    "word": "admissible",
    "definition": "acceptable or valid, especially in court",
    "sentence": "The lawyer argued that the blurry photo was not admissible as evidence in court."
  },
  {
    "word": "admonish",
    "definition": "to caution, criticize, reprove",
    "sentence": "My mom admonished me for eating cake before dinner, but her smile said she understood."
  },
  {
    "word": "adorn",
    "definition": "to decorate",
    "sentence": "They adorned the gymnasium with streamers and balloons until it looked like a party supply store exploded."
  },
  {
    "word": "adroit",
    "definition": "skillful, dexterous",
    "sentence": "The adroit magician shuffled the cards so fast that nobody could follow the trick."
  },
  {
    "word": "adulation",
    "definition": "extreme praise",
    "sentence": "The rock star received so much adulation from fans that she couldn't walk ten feet without being asked for a selfie."
  },
  {
    "word": "adulterate",
    "definition": "to make impure by adding inferior substances",
    "sentence": "Someone had adulterated the lemonade with salt, and the looks on people's faces were priceless."
  },
  {
    "word": "adumbrate",
    "definition": "to sketch out in a vague way",
    "sentence": "The dark clouds adumbrated the thunderstorm that ruined our outdoor concert."
  },
  {
    "word": "advent",
    "definition": "the arrival of a notable event or person",
    "sentence": "The advent of smartphones changed how we do everything, from ordering food to ignoring each other at dinner."
  },
  {
    "word": "adverse",
    "definition": "antagonistic, unfavorable, dangerous",
    "sentence": "Adverse weather conditions turned our relaxing camping trip into a survival challenge."
  },
  {
    "word": "adversity",
    "definition": "a difficult or unfavorable situation",
    "sentence": "She faced adversity with a grin, treating every setback like a plot twist in her personal movie."
  },
  {
    "word": "advert",
    "definition": "to call attention to; to refer",
    "sentence": "He adverted to the fine print, which is where all the sneaky details were hiding."
  },
  {
    "word": "advocate",
    "definition": "to argue in favor of something; a person who argues in favor of something",
    "sentence": "She passionately advocated for longer lunch breaks, and honestly, the whole school supported her."
  },
  {
    "word": "aesthetic",
    "definition": "artistic, related to the appreciation of beauty",
    "sentence": "The café's cozy aesthetic made everyone want to sit there all day pretending to write a novel."
  },
  {
    "word": "affable",
    "definition": "friendly, amiable",
    "sentence": "The affable bus driver greeted every passenger with a smile and a fun fact about the weather."
  },
  {
    "word": "affect",
    "definition": "to have an influence or effect on",
    "sentence": "Lack of sleep can seriously affect your ability to remember things—like where you put your keys."
  },
  {
    "word": "affiliate",
    "definition": "to officially attach or connect to an organization",
    "sentence": "The small gym affiliated with a national chain, which meant fancy equipment and higher membership fees."
  },
  {
    "word": "affinity",
    "definition": "a spontaneous feeling of closeness",
    "sentence": "She had a natural affinity for languages and picked up Spanish in what felt like a weekend."
  },
  {
    "word": "affirm",
    "definition": "to state positively; to declare as true",
    "sentence": "The coach affirmed that hard work beats talent when talent doesn't work hard."
  },
  {
    "word": "affluent",
    "definition": "rich, wealthy",
    "sentence": "The affluent neighborhood had houses so big that getting lost on the way to the bathroom was a real risk."
  },
  {
    "word": "affront",
    "definition": "an insult",
    "sentence": "Serving burnt toast to a French chef was an affront that he never quite forgave."
  },
  {
    "word": "aggrandize",
    "definition": "to increase or make greater",
    "sentence": "He loved to aggrandize his fishing stories until a two-pound bass became a legendary sea monster."
  },
  {
    "word": "aggravate",
    "definition": "to make worse or more serious",
    "sentence": "Poking a sleeping bear would definitely aggravate the situation, so let's not do that."
  },
  {
    "word": "aggregate",
    "definition": "a whole or total",
    "sentence": "The aggregate score from all three rounds determined the final winner of the trivia contest."
  },
  {
    "word": "agile",
    "definition": "quick, nimble",
    "sentence": "The agile gymnast flipped through the air like gravity was just a suggestion."
  },
  {
    "word": "agitate",
    "definition": "to stir up or disturb emotionally",
    "sentence": "The washing machine agitates the clothes, but my little brother agitates me way more effectively."
  },
  {
    "word": "agnostic",
    "definition": "believing that the existence of God cannot be proven or disproven",
    "sentence": "She remained agnostic on the pineapple-pizza debate, refusing to take sides at the dinner table."
  },
  {
    "word": "agog",
    "definition": "very eager or curious to hear or see",
    "sentence": "The kids were all agog when the magician pulled an actual rabbit out of his hat."
  },
  {
    "word": "ailment",
    "definition": "a minor illness or physical complaint",
    "sentence": "Every winter, the same ailment—a stubborn cold—would settle in and refuse to leave."
  },
  {
    "word": "aimless",
    "definition": "without purpose or direction",
    "sentence": "After graduation, he spent an aimless summer wandering from the couch to the fridge and back."
  },
  {
    "word": "akin",
    "definition": "similar in nature or character",
    "sentence": "Her singing voice was akin to an angel's, if angels also occasionally forgot the lyrics."
  },
  {
    "word": "alacrity",
    "definition": "eagerness, speed",
    "sentence": "She accepted the invitation to the amusement park with such alacrity that she was packed before the call ended."
  },
  {
    "word": "alarm",
    "definition": "a sudden fear caused by awareness of danger",
    "sentence": "The fire alarm went off during the test, and half the class looked relieved rather than worried."
  },
  {
    "word": "alchemy",
    "definition": "a medieval pursuit of turning metals into gold",
    "sentence": "Turning leftovers into a gourmet meal felt like alchemy, and my dad was the wizard behind it."
  },
  {
    "word": "alias",
    "definition": "a false name or identity",
    "sentence": "The spy operated under an alias so convincing that even his dentist didn't know his real name."
  },
  {
    "word": "alienate",
    "definition": "to cause someone to feel isolated or estranged",
    "sentence": "His habit of correcting everyone's grammar began to alienate even his closest friends."
  },
  {
    "word": "align",
    "definition": "to place in a straight line or bring into agreement",
    "sentence": "The planets will align next month, which astrology fans insist means something important."
  },
  {
    "word": "allege",
    "definition": "to assert, usually without proof",
    "sentence": "The neighbors alleged that our dog dug up their garden, but we maintained his innocence."
  },
  {
    "word": "alleviate",
    "definition": "to relieve, make more bearable",
    "sentence": "A warm cup of tea can alleviate stress faster than any motivational poster ever could."
  },
  {
    "word": "alliance",
    "definition": "a union formed for mutual benefit",
    "sentence": "The two friend groups formed an alliance to dominate the school's trivia competition."
  },
  {
    "word": "alliteration",
    "definition": "repetition of initial sounds in nearby words",
    "sentence": "Peter Piper picked a peck of pickled peppers is a famous example of alliteration that tortures tongues."
  },
  {
    "word": "allocate",
    "definition": "to distribute, set aside",
    "sentence": "The student council voted to allocate most of the budget to the end-of-year dance."
  },
  {
    "word": "allude",
    "definition": "to refer to indirectly or hint at",
    "sentence": "She kept alluding to a surprise, dropping hints so obvious they were basically neon signs."
  },
  {
    "word": "allure",
    "definition": "the quality of being powerfully attractive",
    "sentence": "The allure of freshly baked cookies drew everyone into the kitchen like a magnet."
  },
  {
    "word": "allusion",
    "definition": "an indirect reference to something",
    "sentence": "His joke about a wooden horse was an allusion to the Trojan War that only the history nerds caught."
  },
  {
    "word": "aloof",
    "definition": "reserved, distant",
    "sentence": "The cat sat aloof on the windowsill, judging everyone in the room with silent superiority."
  },
  {
    "word": "altercation",
    "definition": "a dispute, fight",
    "sentence": "A minor altercation over the last slice of pizza nearly ended a ten-year friendship."
  },
  {
    "word": "alternate",
    "definition": "to occur or do in turns; every other",
    "sentence": "We decided to alternate who picks the movie so nobody has to suffer through another three-hour documentary."
  },
  {
    "word": "altruism",
    "definition": "selfless concern for the well-being of others",
    "sentence": "Her altruism was legendary—she once gave her umbrella away in a rainstorm and walked home soaked."
  },
  {
    "word": "amalgamate",
    "definition": "to bring together, unite",
    "sentence": "The two small schools amalgamated into one, which doubled both the student body and the drama."
  },
  {
    "word": "ambiguous",
    "definition": "uncertain, variably interpretable",
    "sentence": "His ambiguous answer of 'maybe, probably, sort of' left everyone more confused than before."
  },
  {
    "word": "ambivalence",
    "definition": "the state of having mixed or conflicting feelings",
    "sentence": "Her ambivalence about college showed when she submitted applications and gap-year plans on the same day."
  },
  {
    "word": "ambivalent",
    "definition": "having opposing feelings",
    "sentence": "I'm ambivalent about rollercoasters—thrilled during the ride, terrified in the line."
  },
  {
    "word": "amble",
    "definition": "to walk at a slow, relaxed pace",
    "sentence": "We ambled through the park with no destination, just enjoying the sunshine and the ice cream."
  },
  {
    "word": "ameliorate",
    "definition": "to improve",
    "sentence": "A simple apology can ameliorate a tense situation faster than a hundred excuses."
  },
  {
    "word": "amenable",
    "definition": "willing, compliant",
    "sentence": "She was amenable to changing the plans, as long as food was still involved."
  },
  {
    "word": "amend",
    "definition": "to make changes to improve or correct",
    "sentence": "The club voted to amend the rules so that pajamas were acceptable attire at meetings."
  },
  {
    "word": "amiable",
    "definition": "friendly",
    "sentence": "The amiable shopkeeper knew every customer by name and always threw in a free cookie."
  },
  {
    "word": "amicable",
    "definition": "friendly",
    "sentence": "Despite the breakup, they remained amicable enough to share custody of the Netflix account."
  },
  {
    "word": "amiss",
    "definition": "not quite right; inappropriate",
    "sentence": "Something was clearly amiss when the dog greeted us at the door wearing a guilty expression and a shoe."
  },
  {
    "word": "amnesty",
    "definition": "an official pardon for political offenses",
    "sentence": "The library declared an amnesty on overdue fines, and students returned books hidden since freshman year."
  },
  {
    "word": "amoral",
    "definition": "lacking a moral sense; unconcerned with right or wrong",
    "sentence": "The con artist was completely amoral, treating lying the same way most people treat breathing."
  },
  {
    "word": "amorphous",
    "definition": "without definite shape or type",
    "sentence": "The amorphous blob of clay sat on the table, waiting for someone to decide if it was art or a mistake."
  },
  {
    "word": "ample",
    "definition": "more than enough; plentiful",
    "sentence": "There was ample room in the van for all six of us, our luggage, and somehow, a kayak."
  },
  {
    "word": "amplify",
    "definition": "to increase in strength, volume, or extent",
    "sentence": "The microphone amplified his whisper so that the entire auditorium heard him say 'Is this thing on?'"
  },
  {
    "word": "anachronism",
    "definition": "something belonging to a different time period",
    "sentence": "A knight checking his smartphone would be a hilarious anachronism in a medieval movie."
  },
  {
    "word": "anagram",
    "definition": "a word formed by rearranging letters of another",
    "sentence": "She discovered that 'listen' is an anagram of 'silent,' which felt oddly poetic."
  },
  {
    "word": "analogous",
    "definition": "similar to, so that an analogy can be drawn",
    "sentence": "The brain is often described as analogous to a computer, except it crashes way more often during exams."
  },
  {
    "word": "analogy",
    "definition": "a comparison between two similar things",
    "sentence": "He used the analogy of a ship's captain to explain leadership, complete with dramatic hand gestures."
  },
  {
    "word": "analyze",
    "definition": "to examine in detail for explanation",
    "sentence": "After she analyzed the data, she realized the experiment had gone sideways around step three."
  },
  {
    "word": "anarchy",
    "definition": "a state of disorder due to absence of authority",
    "sentence": "When the substitute teacher arrived, the classroom descended into cheerful anarchy."
  },
  {
    "word": "anathema",
    "definition": "a cursed, detested person",
    "sentence": "Early mornings were anathema to him—his body simply rejected consciousness before noon."
  },
  {
    "word": "ancillary",
    "definition": "providing support; supplementary",
    "sentence": "The gift shop was ancillary to the museum but somehow made more money than the exhibits."
  },
  {
    "word": "anecdote",
    "definition": "a short, humorous account",
    "sentence": "Grandpa's anecdote about walking uphill both ways to school got more elaborate every Thanksgiving."
  },
  {
    "word": "anemic",
    "definition": "lacking vitality or force; weak",
    "sentence": "The team's anemic offense scored only twice the entire season, both by accident."
  },
  {
    "word": "anew",
    "definition": "again, in a new or different way",
    "sentence": "After the spectacular failure of version one, she started the science project anew with better glue."
  },
  {
    "word": "angst",
    "definition": "a deep feeling of anxiety or dread",
    "sentence": "Teenage angst filled his poetry notebook with dramatic verses about rainy Tuesdays."
  },
  {
    "word": "animated",
    "definition": "lively",
    "sentence": "The animated debate about the best pizza topping lasted well past midnight."
  },
  {
    "word": "animosity",
    "definition": "strong hostility or ill will",
    "sentence": "Years of animosity between the two chefs ended in a cook-off that was televised nationally."
  },
  {
    "word": "annex",
    "definition": "to incorporate territory or space; a room attached to a larger room or space",
    "sentence": "The country attempted to annex the small island, but the island's five residents voted no."
  },
  {
    "word": "annihilate",
    "definition": "to destroy completely",
    "sentence": "Our team annihilated the competition so thoroughly that the scoreboard almost looked like an error."
  },
  {
    "word": "annotate",
    "definition": "to add explanatory notes to a text",
    "sentence": "She annotated her textbook so heavily that the margins contained more words than the actual pages."
  },
  {
    "word": "annoy",
    "definition": "to irritate or bother someone",
    "sentence": "Little brothers have a supernatural ability to annoy at precisely the worst possible moment."
  },
  {
    "word": "anomaly",
    "definition": "something that does not fit into the normal order",
    "sentence": "Snow in July would be a serious anomaly unless you live in the Southern Hemisphere."
  },
  {
    "word": "anonymity",
    "definition": "the condition of being unnamed or unknown",
    "sentence": "He enjoyed the anonymity of a big city, where nobody cared that he wore pajamas to the grocery store."
  },
  {
    "word": "anonymous",
    "definition": "being unknown, unrecognized",
    "sentence": "The anonymous donor gave a million dollars and asked for nothing in return—not even a thank-you card."
  },
  {
    "word": "antagonist",
    "definition": "a person who actively opposes another",
    "sentence": "Every great story needs an antagonist, and in my life, that role is played by my alarm clock."
  },
  {
    "word": "antagonize",
    "definition": "to provoke hostility in someone",
    "sentence": "She loved to antagonize her brother by hiding the TV remote in increasingly creative locations."
  },
  {
    "word": "antecedent",
    "definition": "something that came before",
    "sentence": "The antecedent of the modern smartphone was a brick-sized device that could barely make a phone call."
  },
  {
    "word": "antedate",
    "definition": "to come before in time; to predate",
    "sentence": "The fossils antedate human civilization by millions of years, which really puts homework deadlines in perspective."
  },
  {
    "word": "anthem",
    "definition": "a rousing or uplifting song of devotion",
    "sentence": "The crowd sang the anthem so loudly that the stadium itself seemed to vibrate."
  },
  {
    "word": "anthology",
    "definition": "a selected collection of writings, songs, etc.",
    "sentence": "The anthology contained short stories from fifty different authors, so there was something for everyone."
  },
  {
    "word": "anticipate",
    "definition": "to expect or look forward to",
    "sentence": "I always anticipate the worst before a dentist appointment, even though it's never as bad as I imagine."
  },
  {
    "word": "anticlimax",
    "definition": "a disappointing end after a buildup",
    "sentence": "After the dramatic buildup, the movie's ending was such an anticlimax that the audience groaned in unison."
  },
  {
    "word": "antidote",
    "definition": "a remedy that counteracts a poison or problem",
    "sentence": "Laughter is the best antidote to a terrible day, followed closely by ice cream."
  },
  {
    "word": "antipathy",
    "definition": "a strong dislike, repugnance",
    "sentence": "Her antipathy toward mornings was so strong that her coffee mug read 'Don't even try before noon.'"
  },
  {
    "word": "antiquated",
    "definition": "old, out of date",
    "sentence": "The school's antiquated computers took so long to start up that you could finish homework by hand first."
  },
  {
    "word": "antithesis",
    "definition": "the absolute opposite",
    "sentence": "She was the antithesis of her twin—one loved chaos, the other color-coded her sock drawer."
  },
  {
    "word": "apathy",
    "definition": "lack of interest, enthusiasm, or concern",
    "sentence": "His apathy toward cleaning was evident from the archaeological layers forming on his bedroom floor."
  },
  {
    "word": "apex",
    "definition": "the highest point or top; the climax",
    "sentence": "Standing at the apex of the mountain, she felt like she was on top of the entire world."
  },
  {
    "word": "aphorism",
    "definition": "a short, clever statement of a general truth",
    "sentence": "The old aphorism 'don't cry over spilled milk' is harder to follow when it's on your new laptop."
  },
  {
    "word": "apocryphal",
    "definition": "fictitious, false, wrong",
    "sentence": "The apocryphal story about the principal wrestling a bear was probably not true, but nobody could prove it."
  },
  {
    "word": "apologetic",
    "definition": "expressing regret or remorse",
    "sentence": "He was so apologetic about stepping on my foot that he bought me lunch for a week."
  },
  {
    "word": "apology",
    "definition": "an expression of regret for wrongdoing",
    "sentence": "Her apology was so sincere that even the person she offended ended up comforting her."
  },
  {
    "word": "apostrophe",
    "definition": "a punctuation mark or direct address to the absent",
    "sentence": "The misplaced apostrophe in 'the dog's are cute' made the English teacher visibly twitch."
  },
  {
    "word": "appall",
    "definition": "to shock or dismay greatly",
    "sentence": "The amount of food wasted in the cafeteria every day would appall anyone who saw the trash bins."
  },
  {
    "word": "apparent",
    "definition": "clearly visible or obvious",
    "sentence": "It was apparent from her smile that she already knew about the surprise party."
  },
  {
    "word": "apparition",
    "definition": "a ghostly figure or unexpected sight",
    "sentence": "The foggy figure in the hallway turned out to be not an apparition but my dad in a bathrobe."
  },
  {
    "word": "appeal",
    "definition": "to make a serious or urgent request",
    "sentence": "The puppy's big brown eyes made a silent appeal that no human heart could resist."
  },
  {
    "word": "appease",
    "definition": "to calm, satisfy",
    "sentence": "She tried to appease the angry customer with a free dessert and a very convincing smile."
  },
  {
    "word": "append",
    "definition": "to add something to the end",
    "sentence": "He decided to append a PS to his letter that was somehow longer than the letter itself."
  },
  {
    "word": "applaud",
    "definition": "to show approval by clapping or praising",
    "sentence": "The audience stood to applaud the young pianist, who looked both thrilled and slightly terrified."
  },
  {
    "word": "applicable",
    "definition": "relevant or appropriate to a situation",
    "sentence": "The coupon was only applicable to purchases over fifty dollars, which felt like a personal attack."
  },
  {
    "word": "appointee",
    "definition": "a person officially chosen for a position",
    "sentence": "The new appointee to the student council immediately proposed Taco Tuesdays."
  },
  {
    "word": "appraise",
    "definition": "to assess the worth or value of",
    "sentence": "The jeweler appraised the ring and told her it was worth significantly more than the box it came in."
  },
  {
    "word": "appreciate",
    "definition": "to recognize the value or be grateful for",
    "sentence": "I didn't fully appreciate how good my mom's cooking was until I tried to feed myself in college."
  },
  {
    "word": "apprehend",
    "definition": "to seize, arrest; to perceive, understand, grasp",
    "sentence": "The police apprehended the suspect three blocks away, still carrying the stolen garden gnome."
  },
  {
    "word": "apprehensive",
    "definition": "anxious or fearful about the future",
    "sentence": "She felt apprehensive about the roller coaster but screamed with joy once it started moving."
  },
  {
    "word": "apprise",
    "definition": "to inform or notify someone",
    "sentence": "Please apprise me of any changes to the schedule so I don't show up on the wrong day again."
  },
  {
    "word": "approach",
    "definition": "to come near or begin to deal with",
    "sentence": "His approach to solving math problems involved staring at them until the answers appeared, which rarely worked."
  },
  {
    "word": "appropriate",
    "definition": "to take, make use of",
    "sentence": "Wearing flip-flops to a job interview is probably not the most appropriate footwear choice."
  },
  {
    "word": "approximate",
    "definition": "close to the actual but not exact",
    "sentence": "The approximate travel time was two hours, but with my dad's shortcuts it somehow took four."
  },
  {
    "word": "apropos",
    "definition": "very appropriate to a particular situation",
    "sentence": "Her comment about needing an umbrella was perfectly apropos, as rain began pouring seconds later."
  },
  {
    "word": "apt",
    "definition": "appropriate or suitable; quick to learn",
    "sentence": "She made an apt comparison between the school hallway and a sardine can during passing period."
  },
  {
    "word": "arbiter",
    "definition": "one who can resolve a dispute, make a decision",
    "sentence": "Mom was the final arbiter of all household disputes, and her rulings were non-negotiable."
  },
  {
    "word": "arbitrary",
    "definition": "based on factors that appear random",
    "sentence": "The teacher's arbitrary seating chart put me between two people who never stopped talking."
  },
  {
    "word": "arbitrate",
    "definition": "to settle a dispute as a neutral party",
    "sentence": "The counselor was called in to arbitrate the argument about who got to use the good markers."
  },
  {
    "word": "arcane",
    "definition": "obscure, secret, known only by a few",
    "sentence": "The board game's arcane rules required a thirty-page manual and a PhD to understand."
  },
  {
    "word": "arch",
    "definition": "chief or principal; deliberately playful",
    "sentence": "She gave an arch smile that said she knew exactly what you were up to."
  },
  {
    "word": "archaic",
    "definition": "of or relating to an earlier period in time, outdated",
    "sentence": "Using a fax machine in the age of email feels wonderfully archaic, like sending messages by carrier pigeon."
  },
  {
    "word": "ardent",
    "definition": "very enthusiastic or passionate",
    "sentence": "He was such an ardent fan of the team that he painted his entire bedroom in their colors."
  },
  {
    "word": "ardor",
    "definition": "extreme vigor, energy, enthusiasm",
    "sentence": "She pursued her music with such ardor that practicing never felt like a chore."
  },
  {
    "word": "arduous",
    "definition": "involving great effort; difficult and tiring",
    "sentence": "The arduous hike up the mountain was worth it once we saw the view from the top."
  },
  {
    "word": "argue",
    "definition": "to present reasons for or against something",
    "sentence": "They could argue about whether a hot dog is a sandwich for literally hours without reaching a conclusion."
  },
  {
    "word": "arid",
    "definition": "excessively dry",
    "sentence": "The arid desert stretched endlessly, making even cacti look like they were begging for water."
  },
  {
    "word": "aristocracy",
    "definition": "the highest social class; government by nobles",
    "sentence": "In old England, the aristocracy spent most of their time throwing elaborate parties and avoiding rain."
  },
  {
    "word": "arrogant",
    "definition": "having an exaggerated sense of superiority",
    "sentence": "He was so arrogant about his cooking that he once critiqued his grandmother's Thanksgiving turkey."
  },
  {
    "word": "artful",
    "definition": "clever or skillful, often in a crafty way",
    "sentence": "The artful negotiator got both siblings to believe they'd received the bigger piece of cake."
  },
  {
    "word": "articulate",
    "definition": "expressing ideas clearly and fluently",
    "sentence": "She was so articulate in her presentation that even the bored kids in the back row started listening."
  },
  {
    "word": "artifice",
    "definition": "clever trickery or skill used to deceive",
    "sentence": "Behind the magician's smile was pure artifice—every casual gesture was carefully rehearsed."
  },
  {
    "word": "artisan",
    "definition": "a craftsman",
    "sentence": "The artisan bread from the local bakery was so good it ruined all other bread forever."
  },
  {
    "word": "ascendancy",
    "definition": "dominance or controlling influence",
    "sentence": "The new player quickly gained ascendancy over the chess club, defeating every member in a week."
  },
  {
    "word": "ascertain",
    "definition": "to perceive, learn",
    "sentence": "The detective needed to ascertain whether the alibi was genuine or just a very creative lie."
  },
  {
    "word": "ascetic",
    "definition": "practicing restraint as a means of self-discipline, usually religious",
    "sentence": "The monk lived an ascetic life with no television, no phone, and apparently, no complaints."
  },
  {
    "word": "ascribe",
    "definition": "to assign, credit, attribute to",
    "sentence": "She ascribed her success to hard work, good coffee, and an unhealthy number of sticky notes."
  },
  {
    "word": "askew",
    "definition": "not straight or level; crooked",
    "sentence": "His tie was askew, his hair was wild, and he still somehow looked confident walking into the interview."
  },
  {
    "word": "assail",
    "definition": "to attack",
    "sentence": "Critics assailed the movie so harshly that even the director admitted it wasn't his best work."
  },
  {
    "word": "assent",
    "definition": "to express agreement or approval",
    "sentence": "The committee gave their assent to the plan, mostly because the free pizza at the meeting was very persuasive."
  },
  {
    "word": "assert",
    "definition": "to state confidently and forcefully",
    "sentence": "She asserted her opinion so confidently that everyone in the room assumed she must be right."
  },
  {
    "word": "assertive",
    "definition": "having a confident and forceful personality",
    "sentence": "Being assertive doesn't mean being rude—it means asking for extra guac without apologizing."
  },
  {
    "word": "assiduous",
    "definition": "hard-working, diligent",
    "sentence": "His assiduous studying paid off when he aced the final exam he'd been dreading all semester."
  },
  {
    "word": "assimilate",
    "definition": "to absorb and integrate into a larger group",
    "sentence": "It took time to assimilate into the new school, but finding the right lunch table helped enormously."
  },
  {
    "word": "assuage",
    "definition": "to ease, pacify",
    "sentence": "A warm blanket and hot chocolate can assuage almost any bad day."
  },
  {
    "word": "astound",
    "definition": "to shock or greatly surprise",
    "sentence": "The magician's final trick astounded the audience so much that people forgot to clap."
  },
  {
    "word": "astute",
    "definition": "very clever, crafty",
    "sentence": "The astute investor noticed the trend before anyone else and made a small fortune."
  },
  {
    "word": "asylum",
    "definition": "a place of refuge, protection, a sanctuary; an institution in which the insane are kept",
    "sentence": "The stray cats found asylum in the kind woman's garage, which she'd converted into a cozy shelter."
  },
  {
    "word": "atheist",
    "definition": "a person who does not believe in God",
    "sentence": "As an atheist, he celebrated the winter holidays with enthusiasm but focused on the cookies rather than the carols."
  },
  {
    "word": "atrocity",
    "definition": "an extremely cruel or wicked act",
    "sentence": "The cafeteria's attempt at sushi was an atrocity against both Japanese cuisine and the concept of lunch."
  },
  {
    "word": "attenuate",
    "definition": "to reduce in force, value, or thickness",
    "sentence": "Distance tends to attenuate sound, which is why your neighbor's music is annoying but not deafening."
  },
  {
    "word": "attest",
    "definition": "to provide evidence or proof of",
    "sentence": "Anyone who has tried her brownies can attest that they are absolutely life-changing."
  },
  {
    "word": "attire",
    "definition": "clothing or garments, especially fine ones",
    "sentence": "His formal attire clashed slightly with the sneakers he'd worn because his dress shoes pinched."
  },
  {
    "word": "audacious",
    "definition": "excessively bold",
    "sentence": "Her audacious plan to ask the CEO for a summer internship actually worked."
  },
  {
    "word": "augment",
    "definition": "to add to, expand",
    "sentence": "He augmented his income by selling homemade dog treats that were suspiciously popular with humans too."
  },
  {
    "word": "augury",
    "definition": "a sign of what will happen; an omen",
    "sentence": "The dark clouds were an augury of the downpour that soaked everyone at the outdoor wedding."
  },
  {
    "word": "austere",
    "definition": "very bare, bleak",
    "sentence": "The austere dormitory had white walls, one chair, and absolutely zero personality."
  },
  {
    "word": "authentic",
    "definition": "genuine and real; not fake",
    "sentence": "The restaurant claimed its tacos were authentic, and the line out the door suggested they weren't lying."
  },
  {
    "word": "authoritative",
    "definition": "reliable and commanding respect",
    "sentence": "Her authoritative tone made even the class clown sit up straight and pay attention."
  },
  {
    "word": "autonomous",
    "definition": "self-governing and independent",
    "sentence": "The autonomous robot vacuum cleaned the house on its own, occasionally terrorizing the cat."
  },
  {
    "word": "avarice",
    "definition": "excessive greed",
    "sentence": "His avarice was so extreme that he charged his own kids interest on their allowance loans."
  },
  {
    "word": "avert",
    "definition": "to turn away or prevent from happening",
    "sentence": "She managed to avert disaster by grabbing the falling cake just inches from the floor."
  },
  {
    "word": "avid",
    "definition": "having a keen interest or enthusiasm",
    "sentence": "An avid reader, she always had a book in her bag, her locker, and under her pillow."
  },
  {
    "word": "avow",
    "definition": "to declare or assert openly",
    "sentence": "He publicly avowed his love for pineapple on pizza despite the social consequences."
  },
  {
    "word": "awry",
    "definition": "away from the expected course; wrong",
    "sentence": "The surprise party went awry when the guest of honor arrived two hours early."
  },
  {
    "word": "axiom",
    "definition": "a statement accepted as true without proof",
    "sentence": "The old axiom that practice makes perfect explains why my piano teacher keeps assigning scales."
  },
  {
    "word": "babble",
    "definition": "to talk rapidly in a foolish or confused way",
    "sentence": "The toddler would babble happily for hours, occasionally producing a word that sounded almost intentional."
  },
  {
    "word": "banal",
    "definition": "dull, commonplace",
    "sentence": "His speech was so banal that three people in the front row actually fell asleep."
  },
  {
    "word": "banish",
    "definition": "to send away as punishment; to exile",
    "sentence": "The queen banished the jester for the crime of telling jokes that were simply too terrible."
  },
  {
    "word": "banter",
    "definition": "playful and friendly exchange of teasing remarks",
    "sentence": "Their playful banter during class made even the teacher struggle not to laugh."
  },
  {
    "word": "barbaric",
    "definition": "savagely cruel or primitive",
    "sentence": "Eating cereal with water instead of milk is nothing short of barbaric."
  },
  {
    "word": "barrage",
    "definition": "an overwhelming quantity or bombardment",
    "sentence": "The reporter faced a barrage of questions, most of which were about the mayor's missing cat."
  },
  {
    "word": "barter",
    "definition": "to trade goods without using money",
    "sentence": "Before money existed, people had to barter, which meant swapping chickens for haircuts."
  },
  {
    "word": "bask",
    "definition": "to lie in and enjoy warmth or glory",
    "sentence": "The lizard loved to bask in the sun, achieving a level of relaxation I deeply envy."
  },
  {
    "word": "bastion",
    "definition": "a stronghold or fortified position",
    "sentence": "The library remained a bastion of quiet in a school full of hallway chaos."
  },
  {
    "word": "befriend",
    "definition": "to act as a friend to someone",
    "sentence": "She managed to befriend the grumpiest kid in class by sharing her homemade cookies."
  },
  {
    "word": "begrudge",
    "definition": "to feel resentment at someone's good fortune",
    "sentence": "I don't begrudge your success, but I do wish you'd be a little less cheerful about it on Mondays."
  },
  {
    "word": "beguile",
    "definition": "to trick, deceive",
    "sentence": "The storyteller beguiled the audience with tales so vivid that everyone forgot about dinner."
  },
  {
    "word": "behemoth",
    "definition": "something of tremendous power or size",
    "sentence": "The new shopping mall was a behemoth that could be seen from three towns away."
  },
  {
    "word": "belabor",
    "definition": "to argue or discuss excessively",
    "sentence": "Please don't belabor the point—we understood after the first forty-five minutes of your explanation."
  },
  {
    "word": "belated",
    "definition": "coming later than expected; delayed",
    "sentence": "His belated birthday card arrived two months late with a sticky note that said 'Better late than never?'"
  },
  {
    "word": "beleaguer",
    "definition": "to trouble persistently; to besiege",
    "sentence": "The beleaguered substitute teacher faced thirty students who smelled weakness."
  },
  {
    "word": "belie",
    "definition": "to give a false impression of; to contradict",
    "sentence": "Her calm expression belied the panic she felt when she realized the presentation was today."
  },
  {
    "word": "belittle",
    "definition": "to make someone seem unimportant",
    "sentence": "A good leader never belittles others, because confidence is built up, not torn down."
  },
  {
    "word": "belligerent",
    "definition": "hostile, aggressive, and ready to fight",
    "sentence": "The belligerent goose chased joggers around the park like it owned the place—which it basically did."
  },
  {
    "word": "bemoan",
    "definition": "to express sorrow or dissatisfaction about",
    "sentence": "He bemoaned the loss of his sandwich with the intensity most people reserve for actual tragedies."
  },
  {
    "word": "benefactor",
    "definition": "a person who gives money or help to others",
    "sentence": "An anonymous benefactor donated enough money to build a new gym, and the whole school celebrated."
  },
  {
    "word": "beneficial",
    "definition": "producing good results; helpful",
    "sentence": "Getting enough sleep is beneficial for memory, mood, and not snapping at people before noon."
  },
  {
    "word": "benevolent",
    "definition": "marked by goodness or doing good",
    "sentence": "The benevolent grandmother secretly paid the college tuition of every kid on her street."
  },
  {
    "word": "benign",
    "definition": "favorable, not threatening, mild",
    "sentence": "The doctor confirmed the lump was benign, and the relief in the room was almost visible."
  },
  {
    "word": "bequeath",
    "definition": "to pass on, give",
    "sentence": "My grandfather bequeathed me his vinyl record collection and, with it, his excellent taste in music."
  },
  {
    "word": "berate",
    "definition": "to scold vehemently",
    "sentence": "The coach berated the referee with such creativity that even the opposing team was impressed."
  },
  {
    "word": "bereave",
    "definition": "to deprive of a loved one through death",
    "sentence": "The family was bereaved by the loss, and the whole community gathered to offer support."
  },
  {
    "word": "bereft",
    "definition": "devoid of, without",
    "sentence": "After losing his lucky socks, he was utterly bereft and refused to play the game."
  },
  {
    "word": "berserk",
    "definition": "wildly out of control with anger or excitement",
    "sentence": "The puppy went absolutely berserk when it saw snow for the first time, zooming in chaotic circles."
  },
  {
    "word": "beseech",
    "definition": "to beg, plead, implore",
    "sentence": "I beseech you to stop microwaving fish in the office break room—it's an act of war."
  },
  {
    "word": "beset",
    "definition": "to trouble or threaten persistently",
    "sentence": "The project was beset by problems from day one, starting with the printer catching fire."
  },
  {
    "word": "besmirch",
    "definition": "to damage someone's reputation",
    "sentence": "One bad review can besmirch a restaurant's reputation faster than a health code violation."
  },
  {
    "word": "bestow",
    "definition": "to give something as a gift or honor",
    "sentence": "The fairy godmother bestowed the gift of perfect hair days, which was honestly more useful than glass slippers."
  },
  {
    "word": "betray",
    "definition": "to be disloyal to; to reveal unintentionally",
    "sentence": "His face betrayed his true feelings—he was clearly not excited about the surprise tofu dinner."
  },
  {
    "word": "bewilder",
    "definition": "to confuse or puzzle completely",
    "sentence": "The magician's trick bewildered the audience so completely that nobody even tried to figure it out."
  },
  {
    "word": "bias",
    "definition": "a tendency, inclination, prejudice",
    "sentence": "Everyone has some kind of bias, even people who insist they're totally objective about everything."
  },
  {
    "word": "bicker",
    "definition": "to argue about trivial matters",
    "sentence": "The siblings bickered over who got the front seat with the dedication of Olympic athletes."
  },
  {
    "word": "biennial",
    "definition": "occurring every two years",
    "sentence": "The biennial festival happens every two years, which means we have plenty of time to plan our costumes."
  },
  {
    "word": "bilateral",
    "definition": "involving two sides or parties",
    "sentence": "The bilateral agreement between the two countries improved trade and reduced tension at the border."
  },
  {
    "word": "bland",
    "definition": "lacking strong flavor or character; dull",
    "sentence": "Hospital food is famously bland, as if flavor itself is considered a health risk."
  },
  {
    "word": "blatant",
    "definition": "done openly and without shame; obvious",
    "sentence": "His blatant cheating was caught when the teacher noticed his answers matched his neighbor's—including the name."
  },
  {
    "word": "bleak",
    "definition": "cold, bare, and lacking hope",
    "sentence": "The weather forecast looked bleak: rain, more rain, and just for variety, freezing rain."
  },
  {
    "word": "blemish",
    "definition": "an imperfection, flaw",
    "sentence": "One tiny blemish on the painting bothered the artist more than anyone else would ever notice."
  },
  {
    "word": "blight",
    "definition": "a plague, disease; something that destroys hope",
    "sentence": "The abandoned factory was a blight on the neighborhood until the community turned it into a garden."
  },
  {
    "word": "blithe",
    "definition": "showing a carefree and cheerful manner",
    "sentence": "Her blithe attitude about the exam worried her friends, who had been studying for weeks."
  },
  {
    "word": "boisterous",
    "definition": "loud and full of energy",
    "sentence": "The boisterous crowd at the football game could be heard from the parking lot across the street."
  },
  {
    "word": "bold",
    "definition": "showing courage and willingness to take risks",
    "sentence": "It was a bold move to wear a Hawaiian shirt to the formal dinner, but somehow he pulled it off."
  },
  {
    "word": "bolster",
    "definition": "to support, strengthen, or prop up",
    "sentence": "A few kind words can bolster someone's confidence more than you might realize."
  },
  {
    "word": "bombastic",
    "definition": "excessively confident, pompous",
    "sentence": "His bombastic speeches were full of grand promises and dramatic hand gestures but very few actual plans."
  },
  {
    "word": "bonanza",
    "definition": "a large amount of something good; a windfall",
    "sentence": "Finding twenty dollars in an old coat pocket felt like a bonanza of unexpected wealth."
  },
  {
    "word": "boon",
    "definition": "a gift or blessing",
    "sentence": "Air conditioning is a boon during summer, transforming unbearable heat into livable comfort."
  },
  {
    "word": "boorish",
    "definition": "rough and bad-mannered; uncouth",
    "sentence": "His boorish table manners included talking with his mouth full and reaching across other people's plates."
  },
  {
    "word": "brevity",
    "definition": "concise and exact use of words; shortness",
    "sentence": "The professor was famous for the brevity of his lectures, which never lasted more than twenty minutes."
  },
  {
    "word": "bridle",
    "definition": "to show resentment; a horse's headgear",
    "sentence": "She bridled at the suggestion that she couldn't handle the job, then proved everyone wrong within a week."
  },
  {
    "word": "brisk",
    "definition": "active, fast, and energetic",
    "sentence": "The brisk morning walk woke her up better than any cup of coffee ever had."
  },
  {
    "word": "brittle",
    "definition": "hard but easily broken; fragile",
    "sentence": "The ancient book's brittle pages crumbled at the edges when she tried to turn them."
  },
  {
    "word": "broach",
    "definition": "to raise a subject for discussion",
    "sentence": "Nobody wanted to broach the subject of the terrible group project, so they all just smiled awkwardly."
  },
  {
    "word": "brook",
    "definition": "to tolerate or allow",
    "sentence": "The strict principal would not brook any nonsense in the hallways between classes."
  },
  {
    "word": "brusque",
    "definition": "short, abrupt, dismissive",
    "sentence": "The brusque receptionist answered every question with one word, making small talk impossible."
  },
  {
    "word": "buck",
    "definition": "to resist or oppose something",
    "sentence": "The rebellious teenager decided to buck tradition by wearing sneakers to the formal dance."
  },
  {
    "word": "buoyant",
    "definition": "cheerful and optimistic; able to float",
    "sentence": "Her buoyant personality could lift the mood of any room she walked into."
  },
  {
    "word": "burgeon",
    "definition": "to grow or expand rapidly",
    "sentence": "The small startup burgeoned into a major company within just three years."
  },
  {
    "word": "burlesque",
    "definition": "a humorous imitation or parody",
    "sentence": "The comedian's burlesque impression of the president had the audience in tears of laughter."
  },
  {
    "word": "burnish",
    "definition": "to polish, shine",
    "sentence": "She burnished her resume by adding every club, volunteer hour, and participation trophy she'd ever earned."
  },
  {
    "word": "buttress",
    "definition": "to support, hold up; something that offers support",
    "sentence": "Strong evidence will buttress your argument better than shouting louder than the other person."
  },
  {
    "word": "bygone",
    "definition": "belonging to an earlier time",
    "sentence": "Rotary phones and cassette tapes are relics of a bygone era that Gen Z finds adorably confusing."
  },
  {
    "word": "cabal",
    "definition": "a secret political group or plot",
    "sentence": "The student council operated like a secret cabal, making decisions in hushed tones at the back table."
  },
  {
    "word": "cajole",
    "definition": "to urge, coax",
    "sentence": "She cajoled her dad into driving her to the mall by offering to wash his car for a month."
  },
  {
    "word": "calamity",
    "definition": "an event with disastrous consequences",
    "sentence": "Forgetting your lines in the school play felt like a personal calamity of epic proportions."
  },
  {
    "word": "calibrate",
    "definition": "to set, standardize",
    "sentence": "You need to calibrate your expectations—this is a class project, not a NASA mission."
  },
  {
    "word": "callous",
    "definition": "harsh, cold, unfeeling",
    "sentence": "His callous response to her problems made her realize he wasn't really a friend at all."
  },
  {
    "word": "candid",
    "definition": "truthful and straightforward; frank",
    "sentence": "Her candid opinion about my haircut was not what I wanted to hear but exactly what I needed."
  },
  {
    "word": "candor",
    "definition": "honesty, frankness",
    "sentence": "I appreciate your candor, even though hearing the truth stings a little."
  },
  {
    "word": "capacious",
    "definition": "very spacious",
    "sentence": "Her capacious backpack could hold textbooks, a lunch, three water bottles, and somehow still had room."
  },
  {
    "word": "capitulate",
    "definition": "to surrender",
    "sentence": "After three hours of negotiation, he finally capitulated and agreed to watch the romantic comedy."
  },
  {
    "word": "capricious",
    "definition": "subject to whim, fickle",
    "sentence": "Spring weather is capricious—sunshine one minute and a snowstorm the next."
  },
  {
    "word": "captious",
    "definition": "tending to find fault; overly critical",
    "sentence": "The captious food critic found fault with everything, including how the napkin was folded."
  },
  {
    "word": "caricature",
    "definition": "an exaggerated portrayal for comic effect",
    "sentence": "The street artist drew a caricature that exaggerated my nose to roughly the size of a small planet."
  },
  {
    "word": "carnage",
    "definition": "the killing of a large number of people",
    "sentence": "The aftermath of the pillow fight was pure carnage—feathers covered every surface in the room."
  },
  {
    "word": "castigate",
    "definition": "to criticize or reprimand severely",
    "sentence": "The editorial castigated the company for its environmental record with some devastatingly sharp sentences."
  },
  {
    "word": "catalyst",
    "definition": "something that causes an important change",
    "sentence": "Meeting her mentor was the catalyst that transformed her vague dream into an actual career plan."
  },
  {
    "word": "catastrophe",
    "definition": "a sudden, widespread disaster",
    "sentence": "Dropping the Thanksgiving turkey on the floor was a catastrophe that no amount of gravy could fix."
  },
  {
    "word": "catharsis",
    "definition": "the release of strong emotions for relief",
    "sentence": "Crying during a sad movie can be a strange form of catharsis that actually makes you feel better afterward."
  },
  {
    "word": "caucus",
    "definition": "a meeting usually held by people working toward the same goal",
    "sentence": "The political caucus met in the gymnasium, where democracy and basketball hoops coexisted awkwardly."
  },
  {
    "word": "causal",
    "definition": "relating to or acting as a cause",
    "sentence": "Scientists established a causal link between eating breakfast and performing better on morning tests."
  },
  {
    "word": "caution",
    "definition": "care taken to avoid danger; a warning",
    "sentence": "The sign urged caution on the slippery floor, but someone always ignored it and wiped out spectacularly."
  },
  {
    "word": "cavalier",
    "definition": "showing a lack of proper concern; dismissive",
    "sentence": "His cavalier attitude about deadlines backfired when the final paper was due at midnight."
  },
  {
    "word": "cede",
    "definition": "to give up power or territory",
    "sentence": "The older sibling reluctantly ceded control of the TV remote after losing a best-of-three thumb war."
  },
  {
    "word": "censure",
    "definition": "harsh criticism; to rebuke formally",
    "sentence": "The committee issued a formal censure against the member who used the emergency budget for a pizza party."
  },
  {
    "word": "cerebral",
    "definition": "related to the intellect",
    "sentence": "The movie was so cerebral that I needed a nap and a diagram to understand the ending."
  },
  {
    "word": "chagrin",
    "definition": "distress caused by humiliation or failure",
    "sentence": "Much to his chagrin, the surprise quiz covered the one chapter he'd decided to skip."
  },
  {
    "word": "chaotic",
    "definition": "in a state of complete disorder",
    "sentence": "The first day of school was chaotic, with lost freshmen wandering the halls like adorable baby deer."
  },
  {
    "word": "charisma",
    "definition": "compelling charm that inspires devotion",
    "sentence": "Her charisma was so magnetic that strangers at bus stops would tell her their life stories."
  },
  {
    "word": "charismatic",
    "definition": "having a magnetic personal charm",
    "sentence": "The charismatic class president could convince anyone to volunteer for anything just by smiling."
  },
  {
    "word": "chastise",
    "definition": "to criticize severely",
    "sentence": "Mom chastised me for leaving wet towels on the floor, a lecture I've memorized by now."
  },
  {
    "word": "chide",
    "definition": "to voice disapproval",
    "sentence": "She gently chided her friend for showing up an hour late to brunch."
  },
  {
    "word": "chimerical",
    "definition": "wildly fanciful or unrealistic",
    "sentence": "His chimerical plan to build a roller coaster in the backyard was ambitious but wildly unrealistic."
  },
  {
    "word": "chronic",
    "definition": "persisting for a long time; constant",
    "sentence": "Her chronic lateness was so predictable that friends started telling her events began thirty minutes early."
  },
  {
    "word": "circumspect",
    "definition": "cautious",
    "sentence": "A circumspect investor researches thoroughly before putting money into anything."
  },
  {
    "word": "circumvent",
    "definition": "to get around",
    "sentence": "Students tried to circumvent the phone ban by hiding them in increasingly creative places."
  },
  {
    "word": "cite",
    "definition": "to quote or refer to as evidence",
    "sentence": "Always cite your sources, unless you want your teacher to give you That Look."
  },
  {
    "word": "civil",
    "definition": "polite and courteous; relating to citizens",
    "sentence": "Despite disagreeing on everything, they managed to keep the debate civil and even shook hands afterward."
  },
  {
    "word": "clairvoyant",
    "definition": "able to perceive things that normal people cannot",
    "sentence": "My mom is practically clairvoyant—she always knows when I'm lying before I even finish the sentence."
  },
  {
    "word": "clandestine",
    "definition": "secret",
    "sentence": "The clandestine meeting in the library was about planning a surprise party, not world domination."
  },
  {
    "word": "clarify",
    "definition": "to make something clearer or easier to understand",
    "sentence": "Could you clarify what you mean by 'a little homework'? Because last time that meant forty pages."
  },
  {
    "word": "clash",
    "definition": "a conflict or disagreement; to collide",
    "sentence": "The two colors clashed so badly that her outfit looked like it was having an argument with itself."
  },
  {
    "word": "classify",
    "definition": "to arrange into groups or categories",
    "sentence": "Scientists classify animals into categories, which is basically organizing nature's filing cabinet."
  },
  {
    "word": "clemency",
    "definition": "mercy",
    "sentence": "The governor granted clemency, reducing the prisoner's sentence after reviewing new evidence."
  },
  {
    "word": "clique",
    "definition": "a small exclusive group of people",
    "sentence": "Every school has a clique that sits at the same lunch table and speaks in inside jokes."
  },
  {
    "word": "coalesce",
    "definition": "to fuse into a whole",
    "sentence": "The scattered ideas eventually coalesced into a brilliant thesis statement at 2 AM."
  },
  {
    "word": "coax",
    "definition": "to gently persuade someone to do something",
    "sentence": "She coaxed the frightened kitten out from under the porch with tuna and a soothing voice."
  },
  {
    "word": "coerce",
    "definition": "to make somebody do something by force or threat",
    "sentence": "You shouldn't coerce people into agreeing with you—persuasion works much better than pressure."
  },
  {
    "word": "cogent",
    "definition": "intellectually convincing",
    "sentence": "Her cogent argument was so well-structured that even the opposition had trouble finding holes in it."
  },
  {
    "word": "cognitive",
    "definition": "relating to thinking and mental processes",
    "sentence": "Puzzles and brain teasers are great for keeping your cognitive skills sharp."
  },
  {
    "word": "coherent",
    "definition": "logically consistent, intelligible",
    "sentence": "After pulling an all-nighter, forming a coherent sentence felt like an Olympic-level challenge."
  },
  {
    "word": "cohesive",
    "definition": "forming a united or well-connected whole",
    "sentence": "A cohesive team communicates well, trusts each other, and argues about lunch in a productive way."
  },
  {
    "word": "coincide",
    "definition": "to occur at the same time or correspond",
    "sentence": "My birthday happened to coincide with the snowstorm, which nature clearly planned as a personal gift."
  },
  {
    "word": "collaborate",
    "definition": "to work together on a shared project",
    "sentence": "The two artists decided to collaborate, producing a mural that neither could have painted alone."
  },
  {
    "word": "collate",
    "definition": "to collect and combine information in order",
    "sentence": "Her job was to collate all the research into one report, which felt like herding academic cats."
  },
  {
    "word": "colleague",
    "definition": "a person you work with professionally",
    "sentence": "My colleague always microwaves fish at lunch, testing the limits of workplace harmony."
  },
  {
    "word": "colloquial",
    "definition": "characteristic of informal conversation",
    "sentence": "The essay lost points because the professor didn't appreciate colloquial phrases like 'totally awesome.'"
  },
  {
    "word": "collusion",
    "definition": "secret agreement, conspiracy",
    "sentence": "The twins operated in such perfect collusion that their parents never figured out who broke the vase."
  },
  {
    "word": "combine",
    "definition": "to join or merge together",
    "sentence": "If you combine chocolate and peanut butter, you get a flavor combination that should have its own holiday."
  },
  {
    "word": "combustible",
    "definition": "able to catch fire and burn easily",
    "sentence": "Keep combustible materials away from the stove unless you want your kitchen to become a firework show."
  },
  {
    "word": "comely",
    "definition": "pleasant to look at; attractive",
    "sentence": "The comely garden with its bright flowers attracted every bee and photographer in the neighborhood."
  },
  {
    "word": "commence",
    "definition": "to begin or start",
    "sentence": "Let the annual sibling rivalry over the Monopoly board officially commence."
  },
  {
    "word": "commend",
    "definition": "to praise formally or officially",
    "sentence": "The teacher commended her for the best research paper she'd seen in twenty years of teaching."
  },
  {
    "word": "commensurate",
    "definition": "corresponding in size or amount",
    "sentence": "The punishment should be commensurate with the crime, not losing TV for life over a broken plate."
  },
  {
    "word": "commiserate",
    "definition": "to express sympathy or pity for someone",
    "sentence": "After the tough exam, the students gathered to commiserate over shared suffering and vending machine snacks."
  },
  {
    "word": "commission",
    "definition": "an instruction or duty given to someone",
    "sentence": "The city hired an artist on commission to paint a mural celebrating the town's history."
  },
  {
    "word": "commitment",
    "definition": "a dedication to a cause or activity",
    "sentence": "Training for a marathon requires the kind of commitment that makes your couch very, very jealous."
  },
  {
    "word": "commodious",
    "definition": "roomy",
    "sentence": "The commodious new apartment had so much space that their furniture looked lonely."
  },
  {
    "word": "commodity",
    "definition": "a raw material or product that can be traded",
    "sentence": "Clean water is the most precious commodity on Earth, though we often take it for granted."
  },
  {
    "word": "commonplace",
    "definition": "not unusual; ordinary and unremarkable",
    "sentence": "Video calls were once futuristic but have become so commonplace that nobody even fixes their hair anymore."
  },
  {
    "word": "commotion",
    "definition": "a state of noisy confusion or disturbance",
    "sentence": "The commotion in the hallway turned out to be caused by a rogue squirrel that got inside the school."
  },
  {
    "word": "communal",
    "definition": "shared by all members of a community",
    "sentence": "The communal kitchen in the dorm required a peace treaty about who washes whose dishes."
  },
  {
    "word": "compact",
    "definition": "closely packed together; a formal agreement",
    "sentence": "She packed her entire life into a compact suitcase using skills that defied the laws of physics."
  },
  {
    "word": "compassion",
    "definition": "sympathetic concern for others' suffering",
    "sentence": "Showing compassion costs nothing but can completely change someone's terrible day."
  },
  {
    "word": "compatible",
    "definition": "able to exist or work together harmoniously",
    "sentence": "They were so compatible as roommates that they even agreed on the thermostat temperature."
  },
  {
    "word": "compel",
    "definition": "to force or drive someone to act",
    "sentence": "The documentary was so powerful it compelled viewers to donate to the cause before the credits rolled."
  },
  {
    "word": "compensate",
    "definition": "to make an appropriate payment for something",
    "sentence": "The airline tried to compensate for the twelve-hour delay with a coupon for a tiny bag of pretzels."
  },
  {
    "word": "competent",
    "definition": "having the ability to do something well",
    "sentence": "She was more than competent at her job—she was the person everyone went to when things went wrong."
  },
  {
    "word": "compile",
    "definition": "to collect and assemble information",
    "sentence": "He compiled all his best recipes into a cookbook titled 'Things That Won't Give You Food Poisoning.'"
  },
  {
    "word": "complacent",
    "definition": "smugly satisfied and unconcerned",
    "sentence": "Don't get complacent after one good grade—the next test could be a completely different beast."
  },
  {
    "word": "complaisant",
    "definition": "willing to please others; agreeable",
    "sentence": "The complaisant host agreed to every guest's request, including the one who wanted breakfast at midnight."
  },
  {
    "word": "complement",
    "definition": "to complete, make perfect",
    "sentence": "The wine perfectly complemented the cheese, creating a combination that made taste buds sing."
  },
  {
    "word": "compliance",
    "definition": "the act of following rules or requests",
    "sentence": "The building was brought into compliance with the fire code after the third alarm in a month."
  },
  {
    "word": "comply",
    "definition": "to act in accordance with a request or rule",
    "sentence": "Students who fail to comply with the dress code get a gentle reminder and a borrowed polo shirt."
  },
  {
    "word": "composed",
    "definition": "calm and in control of one's feelings",
    "sentence": "She remained perfectly composed during the presentation, even when her slides loaded in the wrong order."
  },
  {
    "word": "composure",
    "definition": "the state of being calm and self-controlled",
    "sentence": "He maintained his composure after dropping his lunch tray, bowing to the cafeteria like it was a performance."
  },
  {
    "word": "comprehend",
    "definition": "to understand fully",
    "sentence": "It took me a full minute to comprehend that the email wasn't spam—I'd actually won the contest."
  },
  {
    "word": "comprehensive",
    "definition": "including everything",
    "sentence": "The comprehensive study guide covered everything from chapter one to the meaning of life."
  },
  {
    "word": "compress",
    "definition": "to apply pressure, squeeze together",
    "sentence": "She managed to compress a semester's worth of notes onto one double-sided index card."
  },
  {
    "word": "comprise",
    "definition": "to consist of or be made up of",
    "sentence": "The team comprised students from five different grades, united by their love of trivia."
  },
  {
    "word": "compromise",
    "definition": "a settlement where each side makes concessions",
    "sentence": "Marriage is all about compromise, like agreeing that one person controls the thermostat and the other controls the remote."
  },
  {
    "word": "compunction",
    "definition": "distress caused by feeling guilty",
    "sentence": "He ate the last donut without the slightest compunction, even though everyone was watching."
  },
  {
    "word": "compute",
    "definition": "to calculate or reckon mathematically",
    "sentence": "Even a calculator can't compute how much time I've wasted trying to find matching socks."
  },
  {
    "word": "conceal",
    "definition": "to hide or keep secret",
    "sentence": "She tried to conceal her excitement about the trip, but her grin gave everything away."
  },
  {
    "word": "concede",
    "definition": "to accept as valid",
    "sentence": "After losing the argument with clear evidence, he graciously conceded that peanut butter is indeed better crunchy."
  },
  {
    "word": "conceit",
    "definition": "excessive pride in oneself; a clever idea",
    "sentence": "His conceit about his singing voice was shattered when the karaoke machine scored him a 3 out of 10."
  },
  {
    "word": "concentric",
    "definition": "sharing the same center point",
    "sentence": "The concentric circles on the target got smaller and smaller, taunting the nervous archer."
  },
  {
    "word": "conceptual",
    "definition": "relating to abstract ideas or concepts",
    "sentence": "The art installation was so conceptual that nobody was sure if the empty room was the exhibit or the lobby."
  },
  {
    "word": "concise",
    "definition": "brief and direct in expression",
    "sentence": "A concise email gets read; a five-paragraph email gets skimmed and forgotten."
  },
  {
    "word": "conclude",
    "definition": "to bring to an end; to reach a decision",
    "sentence": "After tasting all twelve flavors, she concluded that chocolate always wins."
  },
  {
    "word": "concoct",
    "definition": "to fabricate, make up",
    "sentence": "He concocted a smoothie from whatever was in the fridge, and the result tasted like regret."
  },
  {
    "word": "concord",
    "definition": "harmonious agreement",
    "sentence": "The two families finally reached concord after a decade-long dispute about the property line."
  },
  {
    "word": "concur",
    "definition": "to agree or have the same opinion",
    "sentence": "I concur with your assessment that naps should be a mandatory part of the school day."
  },
  {
    "word": "condemn",
    "definition": "to express strong disapproval of",
    "sentence": "Critics condemned the sequel for being a lazy copy of the far superior original."
  },
  {
    "word": "condone",
    "definition": "to pardon, deliberately overlook",
    "sentence": "The school does not condone cheating, even if you call it 'collaborative answer-sharing.'"
  },
  {
    "word": "conducive",
    "definition": "making a certain outcome likely; favorable",
    "sentence": "A quiet room with good lighting is much more conducive to studying than a bed with Netflix access."
  },
  {
    "word": "conduct",
    "definition": "to organize, carry out, or behave",
    "sentence": "The way you conduct yourself in a job interview matters just as much as your resume."
  },
  {
    "word": "confederate",
    "definition": "an ally joined by agreement; a co-conspirator",
    "sentence": "The spy's confederate waited at the coffee shop, pretending to read a newspaper upside down."
  },
  {
    "word": "confer",
    "definition": "to discuss or grant something officially",
    "sentence": "The judges conferred for twenty minutes before announcing the winner of the pie-eating contest."
  },
  {
    "word": "confess",
    "definition": "to admit to a wrongdoing or belief",
    "sentence": "I must confess that I'm the one who's been stealing the good pens from the supply closet."
  },
  {
    "word": "confidant",
    "definition": "a person entrusted with secrets",
    "sentence": "A true confidant keeps your secrets locked up tighter than Fort Knox."
  },
  {
    "word": "confident",
    "definition": "feeling certain about one's abilities",
    "sentence": "She walked into the audition looking so confident that the judges assumed she'd already gotten the part."
  },
  {
    "word": "confine",
    "definition": "to keep within limits; to restrict",
    "sentence": "The blizzard confined us to the house for three days, which was cozy for exactly one day."
  },
  {
    "word": "confirm",
    "definition": "to verify or establish the truth of",
    "sentence": "A quick text to confirm the address saved us from driving to the wrong side of town."
  },
  {
    "word": "confiscate",
    "definition": "to seize by authority",
    "sentence": "The teacher confiscated so many phones that her desk drawer buzzed like an angry beehive."
  },
  {
    "word": "conflagration",
    "definition": "great fire",
    "sentence": "What started as a small campfire mishap nearly turned into a conflagration that required three fire trucks."
  },
  {
    "word": "conflate",
    "definition": "to merge or combine two things into one",
    "sentence": "People often conflate being busy with being productive, but they're definitely not the same thing."
  },
  {
    "word": "conflict",
    "definition": "a serious disagreement or struggle",
    "sentence": "The conflict between wanting to sleep in and wanting good grades is the great struggle of student life."
  },
  {
    "word": "conform",
    "definition": "to comply with rules or standards",
    "sentence": "She refused to conform to the trend, wearing mismatched socks as her personal fashion statement."
  },
  {
    "word": "conformity",
    "definition": "behavior in accordance with accepted standards",
    "sentence": "The school's strict conformity rules meant everyone wore the same khakis, creating a sea of beige."
  },
  {
    "word": "confound",
    "definition": "to frustrate, confuse",
    "sentence": "The toddler's ability to unlock any childproof device continued to confound her parents."
  },
  {
    "word": "confront",
    "definition": "to face or challenge directly",
    "sentence": "She decided to confront the bully directly, and her courage inspired three other students to speak up."
  },
  {
    "word": "confuse",
    "definition": "to make unclear or bewilder",
    "sentence": "Identical twins love to confuse their teachers by swapping seats on the first day of school."
  },
  {
    "word": "congenial",
    "definition": "pleasantly agreeable",
    "sentence": "The congenial atmosphere at the dinner party made even the shy guests feel comfortable."
  },
  {
    "word": "congenital",
    "definition": "present from birth; inherent",
    "sentence": "The congenital heart condition was detected at birth and successfully treated by age two."
  },
  {
    "word": "congest",
    "definition": "to block or overcrowd",
    "sentence": "One stalled car can congest an entire highway, turning a ten-minute drive into an hour of misery."
  },
  {
    "word": "conjecture",
    "definition": "an opinion formed without complete evidence",
    "sentence": "Without evidence, any explanation is just conjecture—basically a fancy word for a really confident guess."
  },
  {
    "word": "conjoin",
    "definition": "to join or combine together",
    "sentence": "The two rivers conjoin at the valley floor, merging into one much more impressive waterway."
  },
  {
    "word": "conjure",
    "definition": "to summon by magic; to evoke a mental image",
    "sentence": "The smell of cinnamon can conjure memories of holiday baking faster than any photograph."
  },
  {
    "word": "conscientious",
    "definition": "wishing to do what is right; thorough",
    "sentence": "A conscientious student double-checks their work, which is advice I give but rarely follow."
  },
  {
    "word": "consecrate",
    "definition": "to dedicate something to a holy purpose",
    "sentence": "The community gathered to consecrate the new memorial garden with a moment of silence."
  },
  {
    "word": "consecutive",
    "definition": "following each other without interruption",
    "sentence": "She won the spelling bee five consecutive years, making it less of a contest and more of a ceremony."
  },
  {
    "word": "consensus",
    "definition": "an agreement of opinion",
    "sentence": "The group reached a consensus that pizza was the only acceptable dinner option."
  },
  {
    "word": "consequence",
    "definition": "a result or effect of an action",
    "sentence": "The consequence of eating an entire cake by yourself is a stomachache and zero regrets."
  },
  {
    "word": "consequential",
    "definition": "important or significant in effect",
    "sentence": "The court's consequential ruling affected millions of people across the country."
  },
  {
    "word": "conserve",
    "definition": "to protect from harm or waste",
    "sentence": "We should conserve water, especially those of us who take thirty-minute showers."
  },
  {
    "word": "considerate",
    "definition": "careful not to cause inconvenience to others",
    "sentence": "A considerate roommate doesn't practice trumpet at 6 AM on a Saturday."
  },
  {
    "word": "consistent",
    "definition": "unchanging; acting the same way over time",
    "sentence": "Consistent effort beats occasional bursts of genius almost every time."
  },
  {
    "word": "console",
    "definition": "to comfort someone in grief or disappointment",
    "sentence": "She tried to console her friend after the breakup with ice cream and a terrible movie marathon."
  },
  {
    "word": "consolidate",
    "definition": "to combine into a single stronger unit",
    "sentence": "He consolidated all his scattered notes into one binder, which felt like a major life achievement."
  },
  {
    "word": "conspicuous",
    "definition": "standing out; clearly visible or attracting notice",
    "sentence": "The bright orange hat made him conspicuous in the crowd, which was either the point or a terrible mistake."
  },
  {
    "word": "conspire",
    "definition": "to secretly plan something harmful",
    "sentence": "The clouds seemed to conspire against our picnic, gathering dramatically right at noon."
  },
  {
    "word": "consternation",
    "definition": "a feeling of anxiety or dismay",
    "sentence": "To the consternation of the entire class, the teacher announced a pop quiz on a Friday afternoon."
  },
  {
    "word": "constrain",
    "definition": "to forcibly restrict",
    "sentence": "Budget constraints forced us to build the set out of cardboard, which actually looked amazing."
  },
  {
    "word": "constraint",
    "definition": "a limitation or restriction",
    "sentence": "The biggest constraint on the project wasn't money—it was time, as usual."
  },
  {
    "word": "construct",
    "definition": "to build or form by assembling parts",
    "sentence": "They managed to construct an entire treehouse over a single weekend using teamwork and questionable engineering."
  },
  {
    "word": "construe",
    "definition": "to interpret",
    "sentence": "Don't construe my silence as agreement—I'm just too tired to argue right now."
  },
  {
    "word": "consummate",
    "definition": "to make complete; supremely skilled",
    "sentence": "She was a consummate professional who never once lost her cool, even when the printer jammed for the fifth time."
  },
  {
    "word": "contagion",
    "definition": "the spread of disease or ideas by contact",
    "sentence": "Laughter is a wonderful form of contagion—one giggle can infect an entire room."
  },
  {
    "word": "contemplate",
    "definition": "to think about deeply or at length",
    "sentence": "She sat by the window to contemplate her future, which currently looked like a large question mark."
  },
  {
    "word": "contemporary",
    "definition": "belonging to the same time period; modern",
    "sentence": "Contemporary art can be brilliant or baffling, and sometimes it's both at the same time."
  },
  {
    "word": "contempt",
    "definition": "the feeling that something is worthless",
    "sentence": "He treated the easy assignment with such contempt that he didn't bother reading the instructions—and failed."
  },
  {
    "word": "contend",
    "definition": "to struggle or compete; to assert",
    "sentence": "Three students contended for the title of valedictorian in a race decided by fractions of a GPA point."
  },
  {
    "word": "contention",
    "definition": "a heated disagreement; an assertion",
    "sentence": "The main contention in the debate was whether homework actually helps learning or just causes stress."
  },
  {
    "word": "contest",
    "definition": "to compete for or challenge formally",
    "sentence": "She decided to contest the parking ticket, armed with a photograph and a righteous sense of injustice."
  },
  {
    "word": "context",
    "definition": "the circumstances that surround an event or idea",
    "sentence": "Without context, the text message 'it's done' could mean anything from 'dinner's ready' to something far more dramatic."
  },
  {
    "word": "contiguous",
    "definition": "sharing a border; next to each other",
    "sentence": "The fifty contiguous United States don't include Alaska or Hawaii, which are off doing their own thing."
  },
  {
    "word": "contingent",
    "definition": "dependent on uncertain conditions",
    "sentence": "The field trip was contingent on good behavior, which immediately made everyone suspicious of everyone else."
  },
  {
    "word": "contradict",
    "definition": "to deny or assert the opposite of",
    "sentence": "His actions completely contradicted his words, like saying 'I'm not hungry' while eating a third taco."
  },
  {
    "word": "contrary",
    "definition": "opposite in nature or direction",
    "sentence": "Contrary to popular belief, goldfish actually have decent memories and are judging you."
  },
  {
    "word": "contrast",
    "definition": "to compare in a way that shows differences",
    "sentence": "The contrast between her messy room and her perfectly organized planner was truly remarkable."
  },
  {
    "word": "contrive",
    "definition": "to create or plan cleverly or deviously",
    "sentence": "He contrived a brilliant excuse for being late that involved a parade, a flat tire, and a lost parrot."
  },
  {
    "word": "controversy",
    "definition": "prolonged public disagreement or debate",
    "sentence": "The controversy over the new school mascot dominated hallway conversations for an entire month."
  },
  {
    "word": "convene",
    "definition": "to call together",
    "sentence": "The committee will convene on Thursday to discuss the pressing matter of vending machine selection."
  },
  {
    "word": "conventional",
    "definition": "based on traditional or widely accepted practice",
    "sentence": "Her conventional approach to the project earned a solid B, but the creative students earned the A's."
  },
  {
    "word": "converge",
    "definition": "to come together from different directions",
    "sentence": "Thousands of fans converged on the stadium, turning the parking lot into a tailgating village."
  },
  {
    "word": "converse",
    "definition": "to talk informally; the opposite",
    "sentence": "The strangers began to converse on the train and discovered they'd grown up on the same street."
  },
  {
    "word": "convert",
    "definition": "to change from one form or belief to another",
    "sentence": "The abandoned warehouse was converted into a trendy art gallery with exposed brick and overpriced coffee."
  },
  {
    "word": "convey",
    "definition": "to transport or communicate a message",
    "sentence": "A single look from Mom can convey more meaning than an entire paragraph of words."
  },
  {
    "word": "conviction",
    "definition": "a firmly held belief; a criminal verdict",
    "sentence": "She spoke with such conviction about climate change that half the audience signed a petition on the spot."
  },
  {
    "word": "convince",
    "definition": "to persuade someone to believe or do something",
    "sentence": "No amount of evidence will convince my cat that the red dot from the laser pointer isn't real prey."
  },
  {
    "word": "convivial",
    "definition": "characterized by feasting, drinking, merriment",
    "sentence": "The convivial dinner party featured great food, loud laughter, and at least one accidentally broken glass."
  },
  {
    "word": "convoluted",
    "definition": "intricate, complicated",
    "sentence": "The movie's plot was so convoluted that I needed a flowchart to follow who betrayed whom."
  },
  {
    "word": "copious",
    "definition": "profuse, abundant",
    "sentence": "She took such copious notes that her hand cramped up by page three of the lecture."
  },
  {
    "word": "cordial",
    "definition": "warm, affectionate",
    "sentence": "The two rivals were cordial in public, smiling through handshakes while plotting their next chess move."
  },
  {
    "word": "cornerstone",
    "definition": "a foundation; something of great importance",
    "sentence": "Trust is the cornerstone of any good friendship, along with sharing snacks without being asked."
  },
  {
    "word": "corporeal",
    "definition": "having a physical body; tangible",
    "sentence": "Ghosts are spooky precisely because they lack corporeal form—you can't fight what you can't poke."
  },
  {
    "word": "correlate",
    "definition": "to have a mutual relationship or connection",
    "sentence": "Studies correlate getting enough sleep with better grades, a fact I plan to use to justify sleeping in."
  },
  {
    "word": "correspond",
    "definition": "to match or be equivalent; to exchange letters",
    "sentence": "The pen pals corresponded for years, filling mailboxes with letters about their wildly different lives."
  },
  {
    "word": "corroborate",
    "definition": "to support with evidence",
    "sentence": "Three witnesses corroborated her story, confirming that yes, a seagull really did steal her sandwich."
  },
  {
    "word": "corrosive",
    "definition": "having the tendency to erode or eat away",
    "sentence": "Jealousy is corrosive—it slowly eats away at relationships if you let it fester."
  },
  {
    "word": "cosmopolitan",
    "definition": "sophisticated, worldly",
    "sentence": "The cosmopolitan city offered cuisine from every continent, sometimes on the same block."
  },
  {
    "word": "counterfeit",
    "definition": "made as an imitation to deceive; fake",
    "sentence": "The counterfeit bills looked real until someone noticed that Benjamin Franklin was winking."
  },
  {
    "word": "coup",
    "definition": "a brilliant, unexpected act; the overthrow of a government and assumption of authority",
    "sentence": "Getting the entire family to agree on a restaurant was a diplomatic coup worthy of the history books."
  },
  {
    "word": "courteous",
    "definition": "polite, respectful, and considerate",
    "sentence": "The courteous stranger held the door open and even helped carry the groceries to the car."
  },
  {
    "word": "covenant",
    "definition": "a formal, binding agreement or promise",
    "sentence": "The roommates made a sacred covenant to always replace the toilet paper roll—and one of them actually kept it."
  },
  {
    "word": "covert",
    "definition": "secretly engaged in",
    "sentence": "The covert operation to plan the surprise party involved code names, burner phones, and one very nervous friend."
  },
  {
    "word": "covet",
    "definition": "to desire enviously",
    "sentence": "I covet my neighbor's backyard pizza oven with an intensity that borders on obsession."
  },
  {
    "word": "coy",
    "definition": "reluctant to give details; shy and modest",
    "sentence": "She was coy about her weekend plans, hinting at something exciting without revealing any details."
  },
  {
    "word": "crass",
    "definition": "showing no sensitivity; crude and unrefined",
    "sentence": "His crass joke about the teacher's haircut earned him detention and a reputation he didn't want."
  },
  {
    "word": "credence",
    "definition": "belief in something as true",
    "sentence": "I give no credence to horoscopes, but I still read mine every morning just in case."
  },
  {
    "word": "credible",
    "definition": "able to be believed; convincing",
    "sentence": "The excuse was barely credible, but the teacher accepted it because creativity should be rewarded."
  },
  {
    "word": "credit",
    "definition": "trust in a person's ability to pay; recognition",
    "sentence": "Give credit where it's due—the group project succeeded because of the person who actually did the work."
  },
  {
    "word": "credulous",
    "definition": "too willing to believe things; gullible",
    "sentence": "The credulous tourist believed the street vendor's claim that the watch was a genuine Rolex for ten dollars."
  },
  {
    "word": "crescendo",
    "definition": "a steady increase in intensity or volume",
    "sentence": "The argument built to a crescendo when someone brought up who forgot to buy milk last Tuesday."
  },
  {
    "word": "criterion",
    "definition": "a standard by which something is judged",
    "sentence": "The main criterion for the award was academic excellence, but personality didn't hurt either."
  },
  {
    "word": "critical",
    "definition": "expressing disapproval; extremely important",
    "sentence": "The critical review was so harsh that even the other critics thought it went too far."
  },
  {
    "word": "critique",
    "definition": "a detailed analysis and assessment",
    "sentence": "Her constructive critique improved the essay, while his just said 'needs work' in red pen."
  },
  {
    "word": "crotchety",
    "definition": "irritable and bad-tempered",
    "sentence": "The crotchety neighbor complained about noise levels that only he seemed able to hear."
  },
  {
    "word": "crucial",
    "definition": "of great importance; decisive",
    "sentence": "Studying the night before is crucial unless you enjoy the thrill of improvising answers on a test."
  },
  {
    "word": "crude",
    "definition": "in a raw state; lacking refinement",
    "sentence": "His crude drawing of the solar system looked like a toddler had attacked a piece of paper with crayons."
  },
  {
    "word": "crusade",
    "definition": "a vigorous campaign for a cause",
    "sentence": "She launched a one-person crusade to get recycling bins installed in every classroom."
  },
  {
    "word": "cryptic",
    "definition": "having a meaning that is mysterious or obscure",
    "sentence": "His cryptic text that just said 'the eagle has landed' turned out to mean his pizza had arrived."
  },
  {
    "word": "cumulative",
    "definition": "increasing, building upon itself",
    "sentence": "The cumulative effect of skipping small assignments all semester hit hard during finals week."
  },
  {
    "word": "cunning",
    "definition": "sly, clever at being deceitful",
    "sentence": "The cunning fox figured out how to open the chicken coop, much to the farmer's frustration."
  },
  {
    "word": "curb",
    "definition": "to restrain or keep in check",
    "sentence": "She had to curb her enthusiasm when she found out the concert tickets were for her birthday."
  },
  {
    "word": "curmudgeon",
    "definition": "a bad-tempered, grumpy person",
    "sentence": "The neighborhood curmudgeon kept every ball that landed in his yard, amassing quite a sports collection."
  },
  {
    "word": "cursory",
    "definition": "brief to the point of being superficial",
    "sentence": "A cursory glance at the contract missed the clause about having to wear a chicken costume."
  },
  {
    "word": "curtail",
    "definition": "to lessen, reduce",
    "sentence": "Budget cuts forced the school to curtail the number of field trips from four to zero."
  },
  {
    "word": "cynical",
    "definition": "distrustful of human sincerity or goodness",
    "sentence": "Years of broken campaign promises had made the voters deeply cynical about all politicians."
  },
  {
    "word": "daunt",
    "definition": "to make someone feel intimidated or fearful",
    "sentence": "The thousand-page textbook would daunt anyone, but she broke it into chapters and conquered it."
  },
  {
    "word": "dearth",
    "definition": "a lack, scarcity",
    "sentence": "There was a dearth of good movies that summer, so we just rewatched the same three classics."
  },
  {
    "word": "debacle",
    "definition": "a disastrous failure, disruption",
    "sentence": "The school dance was a complete debacle after the DJ played nothing but polka for three hours."
  },
  {
    "word": "debase",
    "definition": "to lower the quality or esteem of something",
    "sentence": "Using profanity constantly can debase the power of your words when you actually need them."
  },
  {
    "word": "debatable",
    "definition": "open to discussion or argument",
    "sentence": "Whether cats or dogs make better pets is endlessly debatable and has ended friendships."
  },
  {
    "word": "debilitate",
    "definition": "to make someone very weak or infirm",
    "sentence": "The flu debilitated him so badly that walking to the kitchen felt like climbing Everest."
  },
  {
    "word": "debonair",
    "definition": "confident, stylish, and charming",
    "sentence": "The debonair gentleman tipped his hat, flashed a smile, and tripped over the curb."
  },
  {
    "word": "debrief",
    "definition": "to question about a completed task or mission",
    "sentence": "After the disastrous group project, they met to debrief and figure out what went so spectacularly wrong."
  },
  {
    "word": "decadent",
    "definition": "marked by moral or cultural decline; indulgent",
    "sentence": "The decadent chocolate cake had four layers, ganache frosting, and zero nutritional value."
  },
  {
    "word": "deceive",
    "definition": "to cause someone to believe something false",
    "sentence": "The optical illusion deceived everyone into thinking the lines were different lengths."
  },
  {
    "word": "decelerate",
    "definition": "to reduce speed; to slow down",
    "sentence": "The roller coaster began to decelerate just when the screaming reached its peak."
  },
  {
    "word": "decipher",
    "definition": "to decode or figure out something unclear",
    "sentence": "It took ten minutes to decipher the doctor's handwriting on the prescription."
  },
  {
    "word": "decisive",
    "definition": "settling an issue quickly; firm and determined",
    "sentence": "Her decisive action during the crisis prevented what could have been a much bigger problem."
  },
  {
    "word": "declaim",
    "definition": "to speak passionately against something",
    "sentence": "The senator declaimed against the new policy with a passion that rattled the microphone."
  },
  {
    "word": "decline",
    "definition": "to decrease or politely refuse",
    "sentence": "He politely declined the invitation, citing a prior commitment to doing absolutely nothing."
  },
  {
    "word": "decode",
    "definition": "to convert a coded message into normal language",
    "sentence": "It took the team three hours to decode the escape room puzzle, and they barely made it out."
  },
  {
    "word": "decompose",
    "definition": "to break down or decay into simpler parts",
    "sentence": "Fruit left in a backpack will decompose into something that haunts your locker for weeks."
  },
  {
    "word": "decorum",
    "definition": "proper and dignified behavior",
    "sentence": "The students maintained surprising decorum during the assembly, which the principal found suspicious."
  },
  {
    "word": "decree",
    "definition": "an official order with the force of law",
    "sentence": "The principal's decree that backpacks must be clear was met with universal despair."
  },
  {
    "word": "decry",
    "definition": "to criticize openly",
    "sentence": "Environmentalists decried the decision to build a parking lot where the park used to be."
  },
  {
    "word": "deduce",
    "definition": "to reach a conclusion through reasoning",
    "sentence": "From the muddy pawprints and guilty face, I deduced that the dog had been in the garden again."
  },
  {
    "word": "deface",
    "definition": "to ruin or injure something’s appearance",
    "sentence": "Someone defaced the school mural with spray paint, and the art students took it personally."
  },
  {
    "word": "defame",
    "definition": "to damage someone's good reputation",
    "sentence": "Spreading false rumors to defame a classmate can have serious consequences beyond just hurt feelings."
  },
  {
    "word": "default",
    "definition": "a failure to fulfill an obligation",
    "sentence": "When he defaulted on the bet, he owed his friend three weeks of carrying her backpack."
  },
  {
    "word": "defeat",
    "definition": "to win a victory over; to overcome",
    "sentence": "The unexpected defeat in the first round only fueled their determination to win the rematch."
  },
  {
    "word": "defect",
    "definition": "a flaw or imperfection; to abandon a cause",
    "sentence": "A tiny defect in the glass made it look like the fishbowl had a permanent bubble."
  },
  {
    "word": "defend",
    "definition": "to protect from harm or argue in support of",
    "sentence": "She stood up to defend her friend's idea when everyone else in the group dismissed it."
  },
  {
    "word": "deference",
    "definition": "humble respect and submission",
    "sentence": "Out of deference to the elderly professor, the students saved him the best seat in the auditorium."
  },
  {
    "word": "deferential",
    "definition": "showing respect for another’s authority",
    "sentence": "His deferential attitude toward the judges impressed everyone on the debate team."
  },
  {
    "word": "defiant",
    "definition": "openly resistant or challenging authority",
    "sentence": "The defiant toddler crossed her arms, looked her parents in the eye, and said 'no' for the hundredth time."
  },
  {
    "word": "deficiency",
    "definition": "a lack or shortage of something needed",
    "sentence": "A vitamin D deficiency is common in places where the sun apparently takes the winter off."
  },
  {
    "word": "defile",
    "definition": "to make unclean, impure",
    "sentence": "Littering in the national park would defile one of the most beautiful places on earth."
  },
  {
    "word": "define",
    "definition": "to state the exact meaning of",
    "sentence": "How you respond to failure can define your character more than any success ever will."
  },
  {
    "word": "definitive",
    "definition": "decisive and final; the most authoritative",
    "sentence": "The encyclopedia was the definitive source on the topic until the internet came along and said 'hold my beer.'"
  },
  {
    "word": "deflate",
    "definition": "to release air from; to diminish confidence",
    "sentence": "One harsh comment can deflate someone's confidence faster than a pin pops a balloon."
  },
  {
    "word": "deflect",
    "definition": "to cause to change direction; to divert",
    "sentence": "Politicians are experts at deflecting tough questions by answering completely different ones."
  },
  {
    "word": "deft",
    "definition": "skillful, capable",
    "sentence": "With a deft flick of her wrist, she caught the falling glass before it shattered on the floor."
  },
  {
    "word": "defuse",
    "definition": "to reduce the danger or tension in a situation",
    "sentence": "A well-timed joke can defuse an awkward situation faster than any apology."
  },
  {
    "word": "degrade",
    "definition": "to lower in dignity, quality, or character",
    "sentence": "Plastic bags degrade extremely slowly, which is why they outlast most New Year's resolutions."
  },
  {
    "word": "deify",
    "definition": "to worship or regard as a god",
    "sentence": "Some fans deify their favorite celebrities, forgetting that they're regular humans who also burn toast."
  },
  {
    "word": "deign",
    "definition": "to do something considered beneath one's dignity",
    "sentence": "The cat would not deign to eat the generic brand, staring at it with visible contempt."
  },
  {
    "word": "deliberate",
    "definition": "intentional, reflecting careful consideration",
    "sentence": "After deliberate consideration of all the options, she chose the restaurant closest to her house."
  },
  {
    "word": "delineate",
    "definition": "to describe, outline, shed light on",
    "sentence": "The contract clearly delineated each person's responsibilities so nobody could claim ignorance later."
  },
  {
    "word": "delude",
    "definition": "to mislead or deceive the mind of",
    "sentence": "Don't delude yourself into thinking you can write a ten-page paper the night before it's due."
  },
  {
    "word": "deluge",
    "definition": "a great flood or overwhelming amount",
    "sentence": "A deluge of emails flooded her inbox the moment she returned from vacation."
  },
  {
    "word": "demagogue",
    "definition": "a leader who appeals to a people’s prejudices",
    "sentence": "The demagogue whipped up the crowd's anger instead of offering any actual solutions."
  },
  {
    "word": "demanding",
    "definition": "requiring much skill, effort, or attention",
    "sentence": "The demanding teacher assigned more homework than seemed humanly possible, but her students learned the most."
  },
  {
    "word": "demean",
    "definition": "to lower the status or stature of something",
    "sentence": "Making fun of someone's lunch is a quick way to demean them over something that shouldn't matter."
  },
  {
    "word": "demeanor",
    "definition": "outward behavior or bearing",
    "sentence": "Her calm demeanor during the fire drill convinced everyone that she'd make an excellent emergency room doctor."
  },
  {
    "word": "demise",
    "definition": "a person's death; the end of something",
    "sentence": "The demise of the class hamster was mourned with a funeral that included eulogies and tiny flowers."
  },
  {
    "word": "demolish",
    "definition": "to tear down or destroy completely",
    "sentence": "The wrecking ball demolished the old building in seconds, ending decades of history in a cloud of dust."
  },
  {
    "word": "demonstrate",
    "definition": "to clearly show or prove with evidence",
    "sentence": "She demonstrated the chemistry experiment so smoothly that it looked like magic with safety goggles."
  },
  {
    "word": "demote",
    "definition": "to reduce to a lower rank or position",
    "sentence": "The chess piece was jokingly 'demoted' to paperweight after losing the tournament."
  },
  {
    "word": "demure",
    "definition": "quiet, modest, reserved",
    "sentence": "Her demure smile hid a competitive streak that only came out during board game nights."
  },
  {
    "word": "denigrate",
    "definition": "to belittle, diminish the opinion of",
    "sentence": "A good critic evaluates honestly without needing to denigrate the artist as a person."
  },
  {
    "word": "denote",
    "definition": "to indicate or be a sign of",
    "sentence": "In music, a sharp symbol denotes that a note should be played one half step higher."
  },
  {
    "word": "denounce",
    "definition": "to criticize publicly",
    "sentence": "Several students denounced the unfair grading policy in a well-organized letter to the principal."
  },
  {
    "word": "dense",
    "definition": "closely packed together; thick; slow to understand",
    "sentence": "The fog was so dense that driving through it felt like traveling through a cloud."
  },
  {
    "word": "deplete",
    "definition": "to use up or exhaust the supply of",
    "sentence": "Three teenagers can deplete a full refrigerator in a single afternoon."
  },
  {
    "word": "deplore",
    "definition": "to feel or express sorrow, disapproval",
    "sentence": "Animal lovers deplore any form of cruelty toward creatures that can't speak for themselves."
  },
  {
    "word": "deploy",
    "definition": "to position or arrange strategically",
    "sentence": "The teacher deployed her most powerful weapon against sleepy students: a pop quiz."
  },
  {
    "word": "depose",
    "definition": "to remove from power or office",
    "sentence": "The board voted to depose the chairman after the financial scandal became front-page news."
  },
  {
    "word": "deprave",
    "definition": "to corrupt morally",
    "sentence": "Critics worried the violent video game would deprave young minds, but most kids just wanted the high score."
  },
  {
    "word": "deprecate",
    "definition": "to belittle, depreciate",
    "sentence": "She deprecated her own artwork constantly, unable to see what everyone else admired about it."
  },
  {
    "word": "depreciate",
    "definition": "to decrease in value over time",
    "sentence": "New cars depreciate in value the moment you drive them off the lot, which seems deeply unfair."
  },
  {
    "word": "depress",
    "definition": "to make sad; to push down or reduce",
    "sentence": "Rainy days can depress your mood, which is why cozy blankets and hot drinks were invented."
  },
  {
    "word": "deprive",
    "definition": "to take something away from; to deny",
    "sentence": "Sleep deprivation can deprive you of the ability to form coherent sentences—ask any new parent."
  },
  {
    "word": "deride",
    "definition": "to laugh at mockingly, scorn",
    "sentence": "The older kids derided the new dance moves until they realized the whole school had adopted them."
  },
  {
    "word": "derivative",
    "definition": "taken directly from a source, unoriginal",
    "sentence": "The movie felt derivative, borrowing so heavily from classics that it forgot to have its own identity."
  },
  {
    "word": "derive",
    "definition": "to obtain from a source; to originate",
    "sentence": "She derived great satisfaction from finishing the puzzle that had frustrated everyone else."
  },
  {
    "word": "derogatory",
    "definition": "showing disrespect; critical and insulting",
    "sentence": "Derogatory comments about someone's appearance say far more about the speaker than the target."
  },
  {
    "word": "descry",
    "definition": "to catch sight of something difficult to see",
    "sentence": "From the hilltop, she could descry the tiny village in the valley below, nearly hidden by morning mist."
  },
  {
    "word": "desecrate",
    "definition": "to violate the sacredness of a thing or place",
    "sentence": "Carving your name into a historic monument is a terrible way to desecrate something irreplaceable."
  },
  {
    "word": "desist",
    "definition": "to stop doing something; to cease",
    "sentence": "The teacher told him to desist from drumming on his desk, but his fingers had a mind of their own."
  },
  {
    "word": "desolate",
    "definition": "deserted, dreary, lifeless",
    "sentence": "The desolate landscape after the wildfire was heartbreaking, but green shoots appeared within weeks."
  },
  {
    "word": "despair",
    "definition": "the complete loss of hope",
    "sentence": "She felt a wave of despair when her laptop crashed the night before the paper was due."
  },
  {
    "word": "despicable",
    "definition": "deserving hatred and contempt",
    "sentence": "Stealing someone's lunch money is a despicable act that even cartoon villains would find beneath them."
  },
  {
    "word": "despise",
    "definition": "to feel contempt or deep dislike for",
    "sentence": "I despise alarm clocks with the passion of someone who was deeply betrayed at 6 AM this morning."
  },
  {
    "word": "despondent",
    "definition": "feeling depressed, discouraged, hopeless",
    "sentence": "He was despondent after not making the team, but his spirits lifted when the drama club recruited him instead."
  },
  {
    "word": "destitute",
    "definition": "impoverished, utterly lacking",
    "sentence": "The charity provided meals and shelter for families left destitute by the natural disaster."
  },
  {
    "word": "deter",
    "definition": "to discourage, prevent from doing",
    "sentence": "A locked door won't deter a determined cat—they'll just find another way in through the window."
  },
  {
    "word": "deteriorate",
    "definition": "to become progressively worse",
    "sentence": "Without regular maintenance, even the sturdiest building will deteriorate over time."
  },
  {
    "word": "deterrent",
    "definition": "something that discourages an action",
    "sentence": "The threat of extra homework was an effective deterrent against talking during class."
  },
  {
    "word": "detest",
    "definition": "to dislike intensely; to loathe",
    "sentence": "I detest the sound of nails on a chalkboard with every fiber of my being."
  },
  {
    "word": "detract",
    "definition": "to take away from the value of something",
    "sentence": "A few typos can detract from an otherwise brilliant essay, so always proofread."
  },
  {
    "word": "detrimental",
    "definition": "causing harm or damage",
    "sentence": "Staying up all night is detrimental to your health, your mood, and your ability to remember your own name."
  },
  {
    "word": "devious",
    "definition": "not straightforward, deceitful",
    "sentence": "The devious plot to swap the sugar and salt shakers was simple but devastatingly effective."
  },
  {
    "word": "devise",
    "definition": "to plan or invent through careful thought",
    "sentence": "The students devised an elaborate system of hand signals to communicate during the no-talking study hall."
  },
  {
    "word": "devoid",
    "definition": "entirely lacking or empty of",
    "sentence": "His apology was devoid of any actual remorse, which made it worse than saying nothing at all."
  },
  {
    "word": "devote",
    "definition": "to give time or resources to a purpose",
    "sentence": "She devoted every Saturday to volunteering at the animal shelter, which meant she came home covered in fur."
  },
  {
    "word": "devout",
    "definition": "deeply religious or sincerely devoted",
    "sentence": "The devout fan attended every single game, rain or shine, for twenty-three straight years."
  },
  {
    "word": "dexterous",
    "definition": "showing skill with the hands; clever",
    "sentence": "The dexterous surgeon performed the delicate procedure with hands steadier than a statue."
  },
  {
    "word": "diatribe",
    "definition": "a forceful and bitter verbal attack",
    "sentence": "His five-minute diatribe about people who don't use turn signals was both angry and oddly entertaining."
  },
  {
    "word": "dictate",
    "definition": "to state with authority; to command",
    "sentence": "You can't dictate how people feel, but you can control how you respond to them."
  },
  {
    "word": "didactic",
    "definition": "intended to instruct; overly moralistic",
    "sentence": "The didactic children's show taught valuable lessons but was about as subtle as a sledgehammer."
  },
  {
    "word": "diffident",
    "definition": "shy, quiet, modest",
    "sentence": "The diffident student had brilliant ideas but was too shy to share them in class."
  },
  {
    "word": "diffuse",
    "definition": "to scatter, thin out, break up; not concentrated, scattered, disorganized",
    "sentence": "Opening the windows helped diffuse the smell of burnt popcorn throughout the neighborhood."
  },
  {
    "word": "digress",
    "definition": "to stray from the main subject",
    "sentence": "The teacher would digress into stories about her college days, and honestly, those were the best parts of class."
  },
  {
    "word": "dilapidated",
    "definition": "in a state of disrepair; falling apart",
    "sentence": "The dilapidated barn looked one strong wind away from becoming a pile of very rustic firewood."
  },
  {
    "word": "dilate",
    "definition": "to become wider, larger, or more open",
    "sentence": "Her pupils dilated with excitement when she unwrapped the gift and saw the new camera."
  },
  {
    "word": "diligent",
    "definition": "showing care in doing one’s work",
    "sentence": "The diligent student checked her essay five times, finding a new typo each round."
  },
  {
    "word": "diminish",
    "definition": "to make or become less; to reduce",
    "sentence": "Nothing can diminish the joy of the first warm day after a long, brutal winter."
  },
  {
    "word": "din",
    "definition": "a loud, unpleasant, and prolonged noise",
    "sentence": "The din in the cafeteria was so loud that you had to shout to the person sitting next to you."
  },
  {
    "word": "diplomatic",
    "definition": "tactful and skilled in handling people",
    "sentence": "Her diplomatic response to the terrible cooking was 'It's certainly... memorable.'"
  },
  {
    "word": "dire",
    "definition": "extremely serious or urgent",
    "sentence": "The weather forecast was so dire that even the weatherman looked scared."
  },
  {
    "word": "disabuse",
    "definition": "to free someone from a false belief",
    "sentence": "Allow me to disabuse you of the notion that pulling an all-nighter is a good study strategy."
  },
  {
    "word": "discerning",
    "definition": "having sharp judgment and good taste",
    "sentence": "A discerning palate can tell the difference between good chocolate and the waxy stuff in the vending machine."
  },
  {
    "word": "discharge",
    "definition": "to release from duty; to send out",
    "sentence": "The hospital discharged him with instructions to rest, which he interpreted as 'play video games all day.'"
  },
  {
    "word": "discipline",
    "definition": "training to obey rules; a field of study",
    "sentence": "It takes real discipline to study when your phone is right there, glowing with notifications."
  },
  {
    "word": "disclose",
    "definition": "to reveal, make public",
    "sentence": "The company refused to disclose its recipe, guarding it like a state secret."
  },
  {
    "word": "disconcert",
    "definition": "to disturb the composure of; to unsettle",
    "sentence": "It's disconcerting when someone waves at you and you wave back, only to realize they were waving at the person behind you."
  },
  {
    "word": "discord",
    "definition": "disagreement or conflict between people",
    "sentence": "Discord erupted in the group chat after someone suggested replacing pizza Friday with salad Friday."
  },
  {
    "word": "discredit",
    "definition": "to harm the reputation of; to doubt",
    "sentence": "One plagiarized paragraph was enough to discredit the entire research paper."
  },
  {
    "word": "discreet",
    "definition": "careful to avoid attracting attention; tactful",
    "sentence": "She was discreet about the surprise party, never once hinting at it despite the elaborate planning."
  },
  {
    "word": "discrepancy",
    "definition": "difference, failure of things to correspond",
    "sentence": "The discrepancy between his stated age and his birth certificate raised a few eyebrows."
  },
  {
    "word": "discretion",
    "definition": "the quality of being reserved in speech or action; good judgment",
    "sentence": "Use discretion when choosing what to post online—the internet has a very long memory."
  },
  {
    "word": "disdain",
    "definition": "to scorn, hold in low esteem; scorn, low esteem",
    "sentence": "She looked at the instant coffee with undisguised disdain, as if it had personally offended her."
  },
  {
    "word": "disentangle",
    "definition": "to free from a tangle or complication",
    "sentence": "It took an hour to disentangle the Christmas lights, which had formed a knot of festive rage."
  },
  {
    "word": "disgruntled",
    "definition": "upset, not content",
    "sentence": "The disgruntled customers formed a line at the complaint desk that stretched around the building."
  },
  {
    "word": "disguise",
    "definition": "to conceal one's true identity or nature",
    "sentence": "His disguise consisted of a fake mustache and sunglasses, which fooled absolutely nobody."
  },
  {
    "word": "disillusion",
    "definition": "to free from false beliefs; to disappoint",
    "sentence": "College quickly disillusioned her of the idea that adults have everything figured out."
  },
  {
    "word": "disinclined",
    "definition": "unwilling or reluctant",
    "sentence": "After running five miles, I was deeply disinclined to do anything except lie on the floor."
  },
  {
    "word": "disjointed",
    "definition": "lacking a logical sequence; disconnected",
    "sentence": "His disjointed speech jumped between topics so quickly that nobody could follow the thread."
  },
  {
    "word": "dismal",
    "definition": "gloomy, dreary, and depressing",
    "sentence": "The team's dismal record of zero wins and twelve losses made the season mercifully short."
  },
  {
    "word": "dismantle",
    "definition": "to take apart piece by piece",
    "sentence": "She dismantled the old computer to salvage parts, spreading screws across the kitchen table like confetti."
  },
  {
    "word": "dismay",
    "definition": "a feeling of distress caused by something unexpected",
    "sentence": "To our dismay, the ice cream shop was closed on the hottest day of the year."
  },
  {
    "word": "dismiss",
    "definition": "to send away; to reject as unworthy",
    "sentence": "Don't dismiss someone's idea just because they're younger—good thinking has no age requirement."
  },
  {
    "word": "disparage",
    "definition": "to criticize or speak ill of",
    "sentence": "Successful people build others up rather than disparage them to feel superior."
  },
  {
    "word": "disparate",
    "definition": "sharply differing, containing sharply contrasting elements",
    "sentence": "The book club's disparate tastes ranged from mystery novels to quantum physics textbooks."
  },
  {
    "word": "dispatch",
    "definition": "to send off to accomplish a duty",
    "sentence": "The paramedics were dispatched to the scene within minutes of the emergency call."
  },
  {
    "word": "dispel",
    "definition": "to drive away, scatter",
    "sentence": "One honest conversation can dispel more rumors than a hundred angry social media posts."
  },
  {
    "word": "dispense",
    "definition": "to distribute or provide; to do without",
    "sentence": "The machine dispensed exactly one gumball for a quarter, which felt like a fair trade in 1995."
  },
  {
    "word": "disperse",
    "definition": "to scatter, cause to scatter",
    "sentence": "The crowd dispersed quickly once the rain started, leaving the park empty in under a minute."
  },
  {
    "word": "displace",
    "definition": "to move from the proper or usual position",
    "sentence": "The flood displaced hundreds of families, forcing them into temporary shelters across the county."
  },
  {
    "word": "display",
    "definition": "to show or exhibit something publicly",
    "sentence": "The proud parent displayed her child's artwork on the fridge like it belonged in the Louvre."
  },
  {
    "word": "disposition",
    "definition": "a person's inherent qualities of character",
    "sentence": "His cheerful disposition made him the kind of person you wanted around on a bad day."
  },
  {
    "word": "dispute",
    "definition": "a disagreement or argument",
    "sentence": "The siblings' dispute over who owned the last slice of cake required parental intervention."
  },
  {
    "word": "disquiet",
    "definition": "a feeling of unease or anxiety",
    "sentence": "A growing sense of disquiet filled the room when the principal asked everyone to remain seated."
  },
  {
    "word": "disrupt",
    "definition": "to interrupt or throw into disorder",
    "sentence": "One barking dog can disrupt an entire classroom's focus faster than a fire alarm."
  },
  {
    "word": "dissident",
    "definition": "a person who opposes official policy",
    "sentence": "The political dissident risked everything to speak out against injustice in her country."
  },
  {
    "word": "dissonance",
    "definition": "lack of harmony or consistency",
    "sentence": "The dissonance between his words and his actions made it hard to trust anything he said."
  },
  {
    "word": "distill",
    "definition": "to purify or extract the essential meaning",
    "sentence": "A good summary distills a complex argument into a few clear sentences."
  },
  {
    "word": "distinct",
    "definition": "clearly different or separate; unmistakable",
    "sentence": "The twins had distinct personalities—one was loud and adventurous, the other quiet and bookish."
  },
  {
    "word": "distort",
    "definition": "to twist or alter the true meaning or shape",
    "sentence": "Funhouse mirrors distort your reflection in ways that are hilarious for about thirty seconds."
  },
  {
    "word": "distraught",
    "definition": "deeply upset and agitated",
    "sentence": "She was distraught when her phone fell in the lake, mourning it like a fallen friend."
  },
  {
    "word": "distrust",
    "definition": "a feeling of doubt or suspicion",
    "sentence": "Years of broken promises had bred a deep distrust that wouldn't fade with one nice gesture."
  },
  {
    "word": "divergent",
    "definition": "tending to differ or move apart",
    "sentence": "Their divergent opinions on the project led to a heated debate that actually improved the final result."
  },
  {
    "word": "diverse",
    "definition": "showing great variety; different from each other",
    "sentence": "The diverse student body brought together perspectives from over forty different countries."
  },
  {
    "word": "divert",
    "definition": "to redirect or entertain; to distract",
    "sentence": "The clown was hired to divert the children's attention while the parents set up the surprise."
  },
  {
    "word": "divulge",
    "definition": "to reveal something secret",
    "sentence": "A true friend will never divulge your embarrassing secrets, no matter how funny they are."
  },
  {
    "word": "docile",
    "definition": "easily taught or trained",
    "sentence": "The docile golden retriever let the toddler use him as a pillow without complaint."
  },
  {
    "word": "doctrine",
    "definition": "a set of beliefs held by a group",
    "sentence": "The coach's doctrine was simple: work hard, play fair, and never skip leg day."
  },
  {
    "word": "dogged",
    "definition": "having persistent and determined tenacity",
    "sentence": "Her dogged determination to solve the puzzle meant she didn't sleep until every piece was in place."
  },
  {
    "word": "dogma",
    "definition": "a set of principles laid down as undeniable truth",
    "sentence": "Questioning established dogma is how scientific breakthroughs happen, even if it annoys some people."
  },
  {
    "word": "dogmatic",
    "definition": "aggressively and arrogantly certain about unproved principles",
    "sentence": "The dogmatic professor refused to consider any viewpoint that differed from his own."
  },
  {
    "word": "doleful",
    "definition": "expressing sorrow; mournful",
    "sentence": "The dog's doleful expression when we left the house could guilt-trip even the most heartless person."
  },
  {
    "word": "dominate",
    "definition": "to have commanding power or influence over",
    "sentence": "She dominated the debate competition so thoroughly that opponents started studying her strategy."
  },
  {
    "word": "dormant",
    "definition": "sleeping, temporarily inactive",
    "sentence": "The volcano had been dormant for centuries, lulling the nearby town into a false sense of security."
  },
  {
    "word": "dossier",
    "definition": "a collection of documents about a person or topic",
    "sentence": "The detective compiled a thick dossier on the suspect, complete with photos, receipts, and pizza orders."
  },
  {
    "word": "dour",
    "definition": "stern, joyless",
    "sentence": "The dour librarian's frown could silence a room faster than any 'quiet please' sign."
  },
  {
    "word": "drab",
    "definition": "lacking brightness or interest; dull and dreary",
    "sentence": "The drab office was transformed by one employee who brought in a plant and some colorful art prints."
  },
  {
    "word": "draconian",
    "definition": "excessively harsh or severe",
    "sentence": "The draconian new homework policy required three hours of assignments every single night."
  },
  {
    "word": "drastic",
    "definition": "having a strong and far-reaching effect; extreme",
    "sentence": "Shaving your head is a pretty drastic response to one bad haircut."
  },
  {
    "word": "dread",
    "definition": "to anticipate with great fear or anxiety",
    "sentence": "Sunday evenings are filled with the quiet dread of Monday mornings lurking just around the corner."
  },
  {
    "word": "dubious",
    "definition": "doubtful, of uncertain quality",
    "sentence": "His claim that the dog ate his homework was met with dubious looks from the entire class."
  },
  {
    "word": "duplicity",
    "definition": "crafty dishonesty",
    "sentence": "Her duplicity was revealed when she was caught telling opposite stories to different friend groups."
  },
  {
    "word": "durable",
    "definition": "able to withstand wear and last a long time",
    "sentence": "The durable backpack survived four years of being stuffed, dropped, and used as a soccer goal."
  },
  {
    "word": "dwindle",
    "definition": "to gradually become smaller or fewer",
    "sentence": "Motivation tends to dwindle around week three of any New Year's resolution."
  },
  {
    "word": "dynamic",
    "definition": "actively changing",
    "sentence": "The dynamic speaker kept the audience engaged for two hours, which is basically a superpower."
  },
  {
    "word": "earnest",
    "definition": "sincere and serious in intention",
    "sentence": "His earnest attempt to apologize involved flowers, a card, and a promise to never borrow her car again."
  },
  {
    "word": "earthy",
    "definition": "down-to-earth; relating to everyday life",
    "sentence": "Her earthy sense of humor kept conversations real and made even awkward topics feel comfortable."
  },
  {
    "word": "ebullient",
    "definition": "extremely lively, enthusiastic",
    "sentence": "The ebullient puppy greeted every single guest as if they were its long-lost best friend."
  },
  {
    "word": "eccentric",
    "definition": "unconventional and slightly strange",
    "sentence": "The eccentric professor wore a different themed tie for every lecture, from dinosaurs to disco balls."
  },
  {
    "word": "eclectic",
    "definition": "consisting of a diverse variety of elements",
    "sentence": "Her eclectic music taste ranged from classical symphonies to heavy metal, sometimes in the same playlist."
  },
  {
    "word": "economical",
    "definition": "giving good value relative to cost; thrifty",
    "sentence": "Buying in bulk is economical, assuming you can actually eat forty pounds of rice before it expires."
  },
  {
    "word": "edify",
    "definition": "to instruct or improve morally or intellectually",
    "sentence": "Documentaries edify viewers by teaching them things they never knew they wanted to learn."
  },
  {
    "word": "efface",
    "definition": "to wipe out, obliterate, rub away",
    "sentence": "Time can efface even the deepest carvings on ancient stone monuments."
  },
  {
    "word": "effective",
    "definition": "successful in producing a desired result",
    "sentence": "The most effective way to win an argument is with facts, patience, and occasionally, a well-timed chart."
  },
  {
    "word": "efficacy",
    "definition": "the ability to produce a desired effect",
    "sentence": "The efficacy of the new study method was proven when the entire class aced the exam."
  },
  {
    "word": "efficient",
    "definition": "achieving maximum results with minimum waste",
    "sentence": "She was so efficient at packing that she could fit a week's wardrobe into a carry-on."
  },
  {
    "word": "effortless",
    "definition": "requiring no physical or mental effort; easy",
    "sentence": "The ice skater made her triple jump look effortless, hiding years of practice behind a graceful smile."
  },
  {
    "word": "egalitarian",
    "definition": "believing in equal rights for all people",
    "sentence": "The egalitarian club gave every member an equal vote, from the president to the newest recruit."
  },
  {
    "word": "egotistical",
    "definition": "excessively conceited or self-centered",
    "sentence": "His egotistical habit of referring to himself in the third person made conversations exhausting."
  },
  {
    "word": "egregious",
    "definition": "extremely bad",
    "sentence": "The egregious spelling error in the school's welcome banner was noticed by every single parent."
  },
  {
    "word": "elaborate",
    "definition": "complex, detailed, intricate",
    "sentence": "Her elaborate excuse for being late involved a traffic jam, a parade, and a family of ducks crossing the road."
  },
  {
    "word": "elapse",
    "definition": "to pass or slip by, referring to time",
    "sentence": "Hours seemed to elapse in minutes when she was lost in a good book."
  },
  {
    "word": "elastic",
    "definition": "able to stretch and return to original shape",
    "sentence": "The elastic waistband was humanity's greatest invention, especially during Thanksgiving dinner."
  },
  {
    "word": "elated",
    "definition": "overjoyed, thrilled",
    "sentence": "She was elated to learn she'd been accepted, jumping around the kitchen until the neighbors noticed."
  },
  {
    "word": "elevate",
    "definition": "to raise to a higher position or level",
    "sentence": "A single compliment can elevate someone's entire day from terrible to wonderful."
  },
  {
    "word": "elicit",
    "definition": "to bring forth, draw out, evoke",
    "sentence": "The comedian's joke elicited such loud laughter that the people next door thought something had exploded."
  },
  {
    "word": "eliminate",
    "definition": "to completely remove or get rid of",
    "sentence": "Process of elimination is a great test strategy when you have absolutely no idea what the answer is."
  },
  {
    "word": "elite",
    "definition": "a select group that is superior in ability",
    "sentence": "The elite athletes trained six hours a day, making the rest of us feel lazy by comparison."
  },
  {
    "word": "eloquent",
    "definition": "expressive, articulate, moving",
    "sentence": "Her eloquent speech moved half the audience to tears and the other half to a standing ovation."
  },
  {
    "word": "elucidate",
    "definition": "to clarify, explain",
    "sentence": "Could you elucidate your point? Because right now it's about as clear as mud."
  },
  {
    "word": "elusive",
    "definition": "difficult to find, catch, or achieve",
    "sentence": "A good night's sleep becomes increasingly elusive during finals week."
  },
  {
    "word": "emanate",
    "definition": "to issue or spread out from a source",
    "sentence": "Confidence seemed to emanate from her the moment she stepped onto the stage."
  },
  {
    "word": "embark",
    "definition": "to begin a journey or new undertaking",
    "sentence": "They embarked on a road trip with a broken GPS and zero sense of direction—it was the best week ever."
  },
  {
    "word": "embellish",
    "definition": "to decorate, adorn; to add details to, enhance",
    "sentence": "He embellished the story so much that a flat tire became a dramatic car chase with explosions."
  },
  {
    "word": "embezzle",
    "definition": "to steal money by falsifying records",
    "sentence": "The accountant was caught embezzling funds, proving that spreadsheets can be weapons of crime."
  },
  {
    "word": "eminent",
    "definition": "distinguished, prominent, famous",
    "sentence": "The eminent scientist's lecture drew such a huge crowd that they had to move it to the auditorium."
  },
  {
    "word": "empathy",
    "definition": "sensitivity to another’s feelings as if they were one’s own",
    "sentence": "Empathy is the ability to feel what someone else is going through, even if you've never been there yourself."
  },
  {
    "word": "empirical",
    "definition": "based on observation or experience; capable of being proved or disproved by experiment",
    "sentence": "The empirical evidence showed that studying beats guessing, which surprised exactly nobody."
  },
  {
    "word": "emulate",
    "definition": "to imitate",
    "sentence": "Young athletes often emulate their favorite players, copying everything from their moves to their hairstyles."
  },
  {
    "word": "enact",
    "definition": "to make into law; to act out",
    "sentence": "The student government enacted a new policy allowing music in the hallways between classes."
  },
  {
    "word": "encircle",
    "definition": "to form a circle around; to surround",
    "sentence": "The hiking trail encircled the entire lake, offering a different gorgeous view around every bend."
  },
  {
    "word": "encompass",
    "definition": "to surround or include entirely",
    "sentence": "The final exam will encompass everything from the first lecture to yesterday, so study absolutely everything."
  },
  {
    "word": "encounter",
    "definition": "to unexpectedly meet or experience",
    "sentence": "We didn't expect to encounter a moose on our morning jog, but there it was, blocking the trail."
  },
  {
    "word": "encourage",
    "definition": "to give support, confidence, or hope to",
    "sentence": "A good teacher can encourage a struggling student with just a few well-chosen words."
  },
  {
    "word": "encumber",
    "definition": "to weigh down, burden",
    "sentence": "Don't encumber your backpack with things you don't need, unless you enjoy back pain."
  },
  {
    "word": "endearing",
    "definition": "inspiring affection or warm feelings",
    "sentence": "His endearing habit of leaving little notes in her lunchbox started on their first anniversary."
  },
  {
    "word": "endeavor",
    "definition": "to try hard to achieve something",
    "sentence": "Every scientific endeavor begins with someone asking a question that nobody else thought to ask."
  },
  {
    "word": "endemic",
    "definition": "native to and widespread in a particular area",
    "sentence": "Koalas are endemic to Australia, which is just one more reason the continent is extraordinary."
  },
  {
    "word": "endorse",
    "definition": "to declare approval or support of",
    "sentence": "The celebrity endorsed the sneakers so enthusiastically that they sold out within an hour."
  },
  {
    "word": "endow",
    "definition": "to provide with a quality, ability, or asset",
    "sentence": "Nature endowed hummingbirds with the incredible ability to hover in midair and fly backward."
  },
  {
    "word": "endure",
    "definition": "to suffer through patiently; to last",
    "sentence": "The marathon runners endured blisters, exhaustion, and self-doubt, but the finish line made it all worth it."
  },
  {
    "word": "energetic",
    "definition": "showing great activity and vitality",
    "sentence": "The energetic puppy ran circles around the yard until it collapsed into the world's deepest nap."
  },
  {
    "word": "enervate",
    "definition": "to weaken, exhaust",
    "sentence": "The suffocating summer heat seemed to enervate everyone, turning the whole office into a room of zombies."
  },
  {
    "word": "engender",
    "definition": "to bring about, create, generate",
    "sentence": "Acts of kindness engender more kindness, creating a chain reaction that can change a community."
  },
  {
    "word": "engrave",
    "definition": "to carve a design into a hard surface",
    "sentence": "The jeweler engraved their initials on the ring in lettering so tiny you needed a magnifying glass."
  },
  {
    "word": "engross",
    "definition": "to absorb all the attention of",
    "sentence": "The mystery novel engrossed her so completely that she missed her bus stop by three miles."
  },
  {
    "word": "enhance",
    "definition": "to improve the quality or value of",
    "sentence": "A dash of cinnamon can enhance hot chocolate from good to 'please never stop making this.'"
  },
  {
    "word": "enigma",
    "definition": "a person or thing that is mysterious or puzzling",
    "sentence": "How cats always land on their feet remains one of nature's delightful enigmas."
  },
  {
    "word": "enjoin",
    "definition": "to instruct or urge someone to do something",
    "sentence": "The judge enjoined the company from selling the product until the safety investigation was complete."
  },
  {
    "word": "enlighten",
    "definition": "to give greater knowledge or understanding",
    "sentence": "Travel can enlighten you about other cultures in ways no textbook ever could."
  },
  {
    "word": "enmity",
    "definition": "ill will, hatred, hostility",
    "sentence": "The enmity between the two chess champions was legendary, fueled by decades of close matches."
  },
  {
    "word": "enormity",
    "definition": "the great seriousness of something; immense size",
    "sentence": "The enormity of the task didn't hit her until she realized the closet hadn't been cleaned since 2003."
  },
  {
    "word": "enrich",
    "definition": "to improve the quality or value of",
    "sentence": "Learning a second language can enrich your life by opening doors to new friendships and cultures."
  },
  {
    "word": "ensconce",
    "definition": "to settle comfortably and securely",
    "sentence": "The cat ensconced herself in the warmest spot on the couch and refused to move for eight hours."
  },
  {
    "word": "ensure",
    "definition": "to make certain that something happens",
    "sentence": "Double-checking your work is the best way to ensure you don't make careless mistakes."
  },
  {
    "word": "entail",
    "definition": "to include as a necessary step",
    "sentence": "Nobody told me that owning a puppy would entail this much vacuuming."
  },
  {
    "word": "enterprising",
    "definition": "having initiative and resourcefulness",
    "sentence": "The enterprising kid started a lemonade stand that evolved into a full-blown neighborhood franchise."
  },
  {
    "word": "enthrall",
    "definition": "to charm, hold spellbound",
    "sentence": "The storyteller enthralled the children so completely that not one of them noticed bedtime had passed."
  },
  {
    "word": "enthusiastic",
    "definition": "having intense and eager enjoyment",
    "sentence": "The enthusiastic tour guide treated every historical fact like the plot twist of a blockbuster movie."
  },
  {
    "word": "entice",
    "definition": "to attract by offering pleasure or advantage",
    "sentence": "The smell of fresh cookies enticed everyone in the building to magically appear in the kitchen."
  },
  {
    "word": "entire",
    "definition": "whole and complete; with nothing missing",
    "sentence": "She read the entire seven-hundred-page novel in one sitting because she simply couldn't put it down."
  },
  {
    "word": "entitled",
    "definition": "believing oneself deserving of special treatment",
    "sentence": "Feeling entitled to special treatment without earning it is a fast track to being disliked."
  },
  {
    "word": "entreat",
    "definition": "to ask someone earnestly or anxiously",
    "sentence": "He entreated his parents for a later curfew with a PowerPoint presentation that included pie charts."
  },
  {
    "word": "entrench",
    "definition": "to establish firmly and deeply",
    "sentence": "Once a habit becomes entrenched, breaking it requires more willpower than establishing it did."
  },
  {
    "word": "enumerate",
    "definition": "to list or count one by one",
    "sentence": "Let me enumerate the reasons this plan won't work, starting with the fact that we have no budget."
  },
  {
    "word": "enunciate",
    "definition": "to pronounce words clearly",
    "sentence": "The drama teacher made everyone enunciate so clearly that even whispers could be heard in the back row."
  },
  {
    "word": "envelop",
    "definition": "to wrap up or surround completely",
    "sentence": "Fog began to envelop the city, turning every streetlight into a mysterious glowing orb."
  },
  {
    "word": "envious",
    "definition": "feeling resentful desire for another's possessions",
    "sentence": "It's hard not to feel envious of people who can fall asleep the moment their head hits the pillow."
  },
  {
    "word": "ephemeral",
    "definition": "short-lived, fleeting",
    "sentence": "Social media fame is ephemeral—today's viral star is tomorrow's forgotten meme."
  },
  {
    "word": "epic",
    "definition": "grand in scale or character; heroic",
    "sentence": "The snowball fight escalated into an epic battle that involved the entire neighborhood."
  },
  {
    "word": "epigram",
    "definition": "a witty, clever, and brief saying",
    "sentence": "Oscar Wilde was famous for epigrams like calling cynics people who know the price of everything and the value of nothing."
  },
  {
    "word": "epilogue",
    "definition": "a section at the end of a book or play",
    "sentence": "The epilogue revealed what happened to the characters ten years later, which was exactly what I needed."
  },
  {
    "word": "epitaph",
    "definition": "words written in memory of someone who has died",
    "sentence": "His dream epitaph read 'He finally got some peace and quiet,' which his family found hilariously appropriate."
  },
  {
    "word": "epithet",
    "definition": "a descriptive word or phrase for a person",
    "sentence": "The epithet 'The Great' was added to Alexander's name after he conquered half the known world."
  },
  {
    "word": "epitome",
    "definition": "a perfect example, embodiment",
    "sentence": "She was the epitome of grace under pressure, handling the crisis like she'd rehearsed it."
  },
  {
    "word": "equable",
    "definition": "calm and even-tempered; not easily disturbed",
    "sentence": "His equable temperament meant nothing could rattle him—not deadlines, not traffic, not even cold coffee."
  },
  {
    "word": "equanimity",
    "definition": "composure",
    "sentence": "She faced every challenge with such equanimity that people assumed she had a secret stash of patience."
  },
  {
    "word": "equitable",
    "definition": "fair and impartial to all concerned",
    "sentence": "An equitable solution gives everyone a fair share, even if it's not exactly equal."
  },
  {
    "word": "equivocal",
    "definition": "ambiguous, uncertain, undecided",
    "sentence": "His equivocal response of 'maybe, possibly, we'll see' was the verbal equivalent of a shrug."
  },
  {
    "word": "eradicate",
    "definition": "to destroy completely; to eliminate",
    "sentence": "Scientists worked for decades to eradicate smallpox, finally succeeding in one of medicine's greatest victories."
  },
  {
    "word": "erratic",
    "definition": "unpredictable and inconsistent in behavior",
    "sentence": "The squirrel's erratic path across the road gave the driver a minor heart attack."
  },
  {
    "word": "erroneous",
    "definition": "wrong; based on incorrect information",
    "sentence": "The erroneous rumor that school was canceled spread through the group chat like wildfire."
  },
  {
    "word": "erudite",
    "definition": "learned",
    "sentence": "The erudite professor could answer questions about anything from ancient philosophy to modern robotics."
  },
  {
    "word": "escalate",
    "definition": "to increase rapidly in intensity or scope",
    "sentence": "What started as a minor disagreement about music quickly escalated into a full-blown argument about everything."
  },
  {
    "word": "eschew",
    "definition": "to shun, avoid",
    "sentence": "Health-conscious eaters eschew processed food in favor of things that actually grow from the ground."
  },
  {
    "word": "esoteric",
    "definition": "understood by only a select few",
    "sentence": "The professor's esoteric lecture on medieval alchemy lost everyone except the two students who were really into it."
  },
  {
    "word": "essay",
    "definition": "a short written work; to attempt",
    "sentence": "She decided to essay the difficult climb despite having no experience, fueled entirely by stubbornness."
  },
  {
    "word": "essential",
    "definition": "absolutely necessary; extremely important",
    "sentence": "Water and sleep are essential for survival, though teenagers seem to run on Wi-Fi and snacks."
  },
  {
    "word": "establish",
    "definition": "to set up or create on a firm basis",
    "sentence": "She established herself as the best baker in town by winning three county fairs in a row."
  },
  {
    "word": "esteem",
    "definition": "respect and admiration for someone",
    "sentence": "He held his grandmother in such high esteem that he named his firstborn after her."
  },
  {
    "word": "estrange",
    "definition": "to cause someone to become distant or unfriendly",
    "sentence": "Constant arguing can estrange even the closest of friends if nobody's willing to compromise."
  },
  {
    "word": "ethereal",
    "definition": "heavenly, exceptionally delicate or refined",
    "sentence": "The dancer moved with such ethereal grace that she seemed to float above the stage."
  },
  {
    "word": "ethical",
    "definition": "relating to moral principles of right and wrong",
    "sentence": "Making the ethical choice isn't always the easiest one, but it's always the one you can sleep with."
  },
  {
    "word": "euphemism",
    "definition": "a mild expression substituted for a harsh one",
    "sentence": "Calling a used car 'pre-owned' is a euphemism that somehow makes it sound fancier."
  },
  {
    "word": "euphoric",
    "definition": "elated, uplifted",
    "sentence": "She felt euphoric after crossing the finish line, forgetting entirely that her legs were about to give out."
  },
  {
    "word": "evade",
    "definition": "to escape or avoid by cleverness",
    "sentence": "The cat evaded bath time with the skill and determination of a trained escape artist."
  },
  {
    "word": "evaluate",
    "definition": "to assess the value or quality of",
    "sentence": "Take time to evaluate all your options before making a big decision—or at least sleep on it."
  },
  {
    "word": "evasive",
    "definition": "tending to avoid giving direct answers",
    "sentence": "His evasive answers to simple questions made everyone suspect he was hiding something."
  },
  {
    "word": "evenhanded",
    "definition": "fair and impartial in treatment",
    "sentence": "The evenhanded teacher graded every student by the same standard, playing no favorites."
  },
  {
    "word": "evince",
    "definition": "to show, reveal",
    "sentence": "She evinced such enthusiasm for the project that her energy became contagious."
  },
  {
    "word": "evolve",
    "definition": "to develop gradually over time",
    "sentence": "Languages evolve over time, which is why Shakespeare sounds fancy to us but was just normal to him."
  },
  {
    "word": "exacerbate",
    "definition": "to make more violent, intense",
    "sentence": "Scratching a mosquito bite only exacerbates the itch, but knowing that has never stopped anyone."
  },
  {
    "word": "exacting",
    "definition": "making great demands; requiring precision",
    "sentence": "The exacting chef measured every ingredient to the gram, treating cooking like precision chemistry."
  },
  {
    "word": "exalt",
    "definition": "to glorify, praise",
    "sentence": "The crowd exalted the returning heroes with cheers so loud they could be heard three blocks away."
  },
  {
    "word": "exasperate",
    "definition": "to irritate, irk",
    "sentence": "Nothing exasperates a parent quite like asking a teenager to clean their room for the fifth time."
  },
  {
    "word": "excavate",
    "definition": "to dig out of the ground and remove",
    "sentence": "Archaeologists excavated the ancient site carefully, brushing dirt away one grain at a time."
  },
  {
    "word": "exceed",
    "definition": "to go beyond a limit or expectation",
    "sentence": "Her test scores exceeded everyone's expectations, including her own."
  },
  {
    "word": "excel",
    "definition": "to be exceptionally good at something",
    "sentence": "She excelled at math so naturally that classmates called her a human calculator."
  },
  {
    "word": "exceptional",
    "definition": "unusually good; outstanding",
    "sentence": "An exceptional student isn't just smart—they're curious, hardworking, and kind to others."
  },
  {
    "word": "excerpt",
    "definition": "a short passage taken from a longer work",
    "sentence": "The teacher read an excerpt from the novel that was so gripping everyone immediately wanted to read the whole book."
  },
  {
    "word": "excessive",
    "definition": "more than what is normal or necessary",
    "sentence": "His excessive use of exclamation marks made every email read like he was constantly shouting!!!"
  },
  {
    "word": "excise",
    "definition": "to cut out surgically; a tax on goods",
    "sentence": "The editor excised three unnecessary chapters, making the book shorter and much better."
  },
  {
    "word": "exclaim",
    "definition": "to cry out suddenly in surprise or emotion",
    "sentence": "She couldn't help but exclaim with joy when she opened the door to find all her friends inside."
  },
  {
    "word": "exclude",
    "definition": "to shut out or leave out deliberately",
    "sentence": "Nobody likes to feel excluded, which is why the best parties have an open invitation policy."
  },
  {
    "word": "excoriate",
    "definition": "to criticize severely; to strip skin from",
    "sentence": "The food critic excoriated the restaurant so harshly that diners cancelled reservations out of fear."
  },
  {
    "word": "excuse",
    "definition": "a reason given to justify a fault",
    "sentence": "The most creative excuse he ever gave for missing homework involved a rogue sprinkler and a very wet backpack."
  },
  {
    "word": "execute",
    "definition": "to carry out or put into effect",
    "sentence": "She executed the piano piece flawlessly, making months of practice look like natural talent."
  },
  {
    "word": "exemplary",
    "definition": "serving as a desirable model; outstanding",
    "sentence": "His exemplary behavior earned him the trust of every teacher in the school."
  },
  {
    "word": "exemplify",
    "definition": "to serve as a typical example of",
    "sentence": "She exemplifies what it means to lead by example, always the first to volunteer."
  },
  {
    "word": "exert",
    "definition": "to apply force or effort",
    "sentence": "You don't have to exert yourself at the gym to get fit—a daily walk works wonders too."
  },
  {
    "word": "exhaustive",
    "definition": "thorough and complete; leaving nothing out",
    "sentence": "The exhaustive investigation left no stone unturned and no filing cabinet unopened."
  },
  {
    "word": "exhilarate",
    "definition": "to make someone feel very happy and excited",
    "sentence": "The first ride on a motorcycle exhilarated him so much that he signed up for riding lessons that afternoon."
  },
  {
    "word": "exhort",
    "definition": "to urge, prod, spur",
    "sentence": "The coach exhorted the team to give everything they had in the final quarter."
  },
  {
    "word": "exigency",
    "definition": "an urgent need or demand",
    "sentence": "The exigency of the flooding required immediate evacuation—there was no time for packing."
  },
  {
    "word": "exile",
    "definition": "the state of being banned from one's home country",
    "sentence": "Being grounded is basically exile for teenagers, cut off from society and forced into solitary reflection."
  },
  {
    "word": "existential",
    "definition": "relating to human existence and its meaning",
    "sentence": "Staring at the ceiling at 2 AM leads to existential questions like 'What am I doing with my life?'"
  },
  {
    "word": "exonerate",
    "definition": "to free from guilt or blame, exculpate",
    "sentence": "New DNA evidence exonerated the man who had spent fifteen years in prison for a crime he didn't commit."
  },
  {
    "word": "expand",
    "definition": "to become or make larger in size or scope",
    "sentence": "Reading regularly can expand your vocabulary without you even realizing it's happening."
  },
  {
    "word": "expedite",
    "definition": "to speed up the progress of",
    "sentence": "Paying extra to expedite shipping felt silly until the package arrived the next day."
  },
  {
    "word": "expel",
    "definition": "to force out or dismiss officially",
    "sentence": "The school threatened to expel anyone caught vandalizing property, and the graffiti stopped overnight."
  },
  {
    "word": "expend",
    "definition": "to spend or use up resources",
    "sentence": "Don't expend all your energy on the first mile of a marathon—you still have twenty-five to go."
  },
  {
    "word": "experience",
    "definition": "practical contact with events; to encounter",
    "sentence": "There's no substitute for experience, which is just a polite way of saying 'learn from your mistakes.'"
  },
  {
    "word": "expertise",
    "definition": "expert skill or knowledge in a field",
    "sentence": "Her expertise in coding was so well known that friends called her instead of tech support."
  },
  {
    "word": "expiate",
    "definition": "to make amends for, atone",
    "sentence": "He tried to expiate his guilt for forgetting the anniversary by cooking a seven-course dinner."
  },
  {
    "word": "explicit",
    "definition": "stated clearly and in detail; leaving no doubt",
    "sentence": "The instructions were so explicit that even someone who'd never cooked could follow the recipe perfectly."
  },
  {
    "word": "exploit",
    "definition": "to make use of; to take unfair advantage of",
    "sentence": "Companies that exploit their workers eventually lose the talented people they depend on."
  },
  {
    "word": "explore",
    "definition": "to travel through or examine thoroughly",
    "sentence": "Children naturally want to explore everything, which is why childproofing exists."
  },
  {
    "word": "expose",
    "definition": "to reveal or make visible something hidden",
    "sentence": "The journalist's article exposed the corruption that officials had been hiding for years."
  },
  {
    "word": "expound",
    "definition": "to explain or present in detail",
    "sentence": "She could expound on the history of ancient Rome for hours without once glancing at her notes."
  },
  {
    "word": "expressive",
    "definition": "effectively conveying thought or feeling",
    "sentence": "Her expressive face made her terrible at poker but amazing at charades."
  },
  {
    "word": "expunge",
    "definition": "to obliterate, eradicate",
    "sentence": "The court agreed to expunge the minor offense from his record so it wouldn't follow him forever."
  },
  {
    "word": "extant",
    "definition": "existing, not destroyed or lost",
    "sentence": "Only a few extant copies of the original manuscript survive, each worth a small fortune."
  },
  {
    "word": "extend",
    "definition": "to make longer or stretch out",
    "sentence": "The teacher agreed to extend the deadline after the entire class collectively forgot about the assignment."
  },
  {
    "word": "extensive",
    "definition": "covering a large area; wide-ranging",
    "sentence": "Her extensive collection of vinyl records filled two rooms and a portion of the hallway."
  },
  {
    "word": "extenuate",
    "definition": "to make a fault seem less serious",
    "sentence": "While nothing can fully extenuate his mistake, the pressure he was under does provide some context."
  },
  {
    "word": "extol",
    "definition": "to praise, revere",
    "sentence": "Grandmothers will extol their grandchildren's talents to literally anyone who will listen."
  },
  {
    "word": "extract",
    "definition": "to remove or pull out",
    "sentence": "The dentist extracted the tooth so quickly that the patient barely had time to panic."
  },
  {
    "word": "extraneous",
    "definition": "irrelevant, extra, not necessary",
    "sentence": "Remove any extraneous details from your essay—if it doesn't support your argument, cut it."
  },
  {
    "word": "extraordinary",
    "definition": "very unusual or remarkable",
    "sentence": "Ordinary people doing extraordinary things is basically the plot of every good superhero origin story."
  },
  {
    "word": "extrapolate",
    "definition": "to extend known data to predict unknowns",
    "sentence": "Based on current trends, scientists extrapolated that temperatures would continue to rise for decades."
  },
  {
    "word": "extravagant",
    "definition": "exceeding what is reasonable; lavish",
    "sentence": "The extravagant wedding featured an ice sculpture, a live orchestra, and a cake taller than the bride."
  },
  {
    "word": "extreme",
    "definition": "reaching the highest degree; very severe",
    "sentence": "Eating a ghost pepper is an extreme choice that you will regret for approximately the next six hours."
  },
  {
    "word": "exuberant",
    "definition": "filled with lively energy and excitement",
    "sentence": "The exuberant fans rushed the field after the winning goal, turning the pitch into a dance floor."
  },
  {
    "word": "fabricate",
    "definition": "to make up, invent; the wall of a building; a deceptive appearance or attitude",
    "sentence": "He fabricated the entire story about meeting a celebrity, and nobody believed him anyway."
  },
  {
    "word": "facetious",
    "definition": "treating serious issues with inappropriate humor",
    "sentence": "Her facetious suggestion to cancel all exams was met with laughter, then wistful sighing."
  },
  {
    "word": "facilitate",
    "definition": "to make an action or process easier",
    "sentence": "Good lighting and comfortable chairs facilitate productive studying way more than people realize."
  },
  {
    "word": "faction",
    "definition": "a small dissenting group within a larger one",
    "sentence": "The club split into two factions over the critical issue of whether meetings should include snacks."
  },
  {
    "word": "factual",
    "definition": "based on or concerned with facts",
    "sentence": "Wikipedia is useful for getting started, but always verify with factual, peer-reviewed sources."
  },
  {
    "word": "fad",
    "definition": "a temporary fashion or craze",
    "sentence": "Every decade has its fads—pet rocks, fidget spinners, and whatever comes next."
  },
  {
    "word": "faint",
    "definition": "lacking strength or clarity; barely perceptible",
    "sentence": "The faint smell of cinnamon rolls drifting from the bakery was enough to reroute my entire walk."
  },
  {
    "word": "fallacy",
    "definition": "a mistaken belief or false reasoning",
    "sentence": "The idea that you only use ten percent of your brain is a popular fallacy that neuroscientists love to debunk."
  },
  {
    "word": "falter",
    "definition": "to lose strength or momentum; to hesitate",
    "sentence": "Her voice didn't falter once during the speech, even though her knees were shaking underneath the podium."
  },
  {
    "word": "fanatic",
    "definition": "a person with extreme and uncritical enthusiasm",
    "sentence": "The coffee fanatic owned three different brewing devices and could tell you the origin of every bean."
  },
  {
    "word": "fanciful",
    "definition": "existing only in the imagination; whimsical",
    "sentence": "Her fanciful stories about talking animals captivated every child in the library."
  },
  {
    "word": "fastidious",
    "definition": "meticulous, demanding, having high and often unattainable standards",
    "sentence": "The fastidious cat groomed herself for an hour each day, maintaining standards the rest of us can only dream of."
  },
  {
    "word": "fatalistic",
    "definition": "believing that all events are predetermined",
    "sentence": "His fatalistic attitude of 'whatever happens, happens' was either deeply philosophical or deeply lazy."
  },
  {
    "word": "fathom",
    "definition": "to understand, comprehend",
    "sentence": "I cannot fathom how she memorized an entire textbook in three days."
  },
  {
    "word": "fatigue",
    "definition": "extreme tiredness from physical or mental effort",
    "sentence": "Mental fatigue after a long test can feel just as exhausting as running a 10K."
  },
  {
    "word": "feasible",
    "definition": "possible and practical to accomplish",
    "sentence": "Building a treehouse seemed feasible until we realized none of us had ever held a hammer."
  },
  {
    "word": "feign",
    "definition": "to pretend to feel or be affected by",
    "sentence": "He feigned surprise at the party so convincingly that his friends still don't know he overheard the planning."
  },
  {
    "word": "felicitous",
    "definition": "well suited, apt; delightful, pleasing",
    "sentence": "The felicitous timing of his joke broke the tension in the room perfectly."
  },
  {
    "word": "feral",
    "definition": "wild, savage",
    "sentence": "The feral cat colony behind the restaurant was secretly fed by every employee on the night shift."
  },
  {
    "word": "ferocious",
    "definition": "savagely fierce, cruel, or violent",
    "sentence": "The toddler's ferocious tantrum over the wrong color cup rivaled any movie villain's meltdown."
  },
  {
    "word": "fertile",
    "definition": "producing abundant vegetation or offspring",
    "sentence": "The fertile soil in the valley produced crops so abundant that farmers ran out of storage space."
  },
  {
    "word": "fervent",
    "definition": "ardent, passionate",
    "sentence": "Her fervent belief in the team's potential kept everyone motivated even during the losing streak."
  },
  {
    "word": "fiasco",
    "definition": "a complete and embarrassing failure",
    "sentence": "The bake sale was a fiasco—the cookies were burnt, the brownies collapsed, and someone forgot the table."
  },
  {
    "word": "fickle",
    "definition": "shifting in character, inconstant",
    "sentence": "Fashion is fickle—what's trendy today will be embarrassing in photos ten years from now."
  },
  {
    "word": "fidelity",
    "definition": "loyalty, devotion",
    "sentence": "The movie's fidelity to the original book impressed even the most devoted fans of the novel."
  },
  {
    "word": "figurative",
    "definition": "symbolic",
    "sentence": "When she said 'I'm dying of boredom,' she was being figurative, though her expression said otherwise."
  },
  {
    "word": "finicky",
    "definition": "fussy about one's needs or requirements",
    "sentence": "The finicky eater rejected every dish that contained a visible vegetable, no matter how it was disguised."
  },
  {
    "word": "finite",
    "definition": "having limits or bounds; not infinite",
    "sentence": "Time is finite, which is why spending it on things you love is never a waste."
  },
  {
    "word": "firm",
    "definition": "having a solid structure; resolute and determined",
    "sentence": "She was firm in her decision to quit the team, despite everyone trying to change her mind."
  },
  {
    "word": "fiscal",
    "definition": "relating to government revenue and finances",
    "sentence": "The club's fiscal responsibility meant they always had money left for an end-of-year party."
  },
  {
    "word": "flagrant",
    "definition": "offensive, egregious",
    "sentence": "His flagrant disregard for the rules resulted in an immediate red card and a walk of shame."
  },
  {
    "word": "flair",
    "definition": "a natural talent or instinctive style",
    "sentence": "She had a flair for dramatic entrances, once arriving at a party on a bicycle covered in streamers."
  },
  {
    "word": "flaw",
    "definition": "a defect or imperfection",
    "sentence": "Every plan has a flaw; the trick is finding it before your plan finds it for you."
  },
  {
    "word": "fledgling",
    "definition": "a young or inexperienced person; just beginning",
    "sentence": "The fledgling business started in a garage but moved to a real office after its first profitable year."
  },
  {
    "word": "flexible",
    "definition": "able to bend easily; willing to change",
    "sentence": "Being flexible with your schedule makes you much easier to plan things with and harder to stress out."
  },
  {
    "word": "florid",
    "definition": "flowery, ornate",
    "sentence": "His florid writing style used so many adjectives that a single sentence could fill an entire paragraph."
  },
  {
    "word": "flourish",
    "definition": "to grow or develop in a healthy way; to thrive",
    "sentence": "Plants flourish when given sunlight and water, and students flourish when given encouragement and support."
  },
  {
    "word": "flout",
    "definition": "to disregard or disobey openly",
    "sentence": "Teenagers love to flout rules that seem pointless, like not being allowed to wear hats indoors."
  },
  {
    "word": "fluctuate",
    "definition": "to rise and fall irregularly",
    "sentence": "Gas prices fluctuate so wildly that filling your tank feels like gambling."
  },
  {
    "word": "flummox",
    "definition": "to perplex or bewilder completely",
    "sentence": "The riddle flummoxed the entire class, leaving thirty confused faces staring at the whiteboard."
  },
  {
    "word": "foible",
    "definition": "a minor weakness or quirk in character",
    "sentence": "Everyone has foibles—his was an inability to resist buying books he'd never have time to read."
  },
  {
    "word": "forage",
    "definition": "to graze, rummage for food",
    "sentence": "Bears forage for berries in summer, building up reserves for their long winter nap."
  },
  {
    "word": "forbear",
    "definition": "to refrain from doing something",
    "sentence": "She chose to forbear from commenting, knowing that saying nothing was wiser than saying the wrong thing."
  },
  {
    "word": "forbid",
    "definition": "to refuse to allow; to prohibit",
    "sentence": "The sign forbade flash photography, but someone's phone went off anyway, startling the entire gallery."
  },
  {
    "word": "foreboding",
    "definition": "a feeling that something bad will happen",
    "sentence": "The dark hallway gave her a sense of foreboding, like something was about to jump out from behind a locker."
  },
  {
    "word": "foresee",
    "definition": "to predict or know in advance",
    "sentence": "Nobody could have foreseen that the quiet kid in class would become a famous rock star."
  },
  {
    "word": "foreshadow",
    "definition": "to warn of or indicate a future event",
    "sentence": "The ominous music in the first scene foreshadowed the twist ending that nobody saw coming."
  },
  {
    "word": "forfeit",
    "definition": "to lose as a penalty for wrongdoing",
    "sentence": "Arriving late to the chess match meant she had to forfeit the game without playing a single move."
  },
  {
    "word": "forlorn",
    "definition": "lonely, abandoned, hopeless",
    "sentence": "The forlorn puppy at the shelter looked at visitors with eyes that said 'please take me home.'"
  },
  {
    "word": "formidable",
    "definition": "inspiring fear or respect through being powerful",
    "sentence": "Her résumé was so formidable that the interviewers were slightly intimidated before she even walked in."
  },
  {
    "word": "forthright",
    "definition": "direct and outspoken; straightforward",
    "sentence": "His forthright honesty was refreshing—he told you exactly what he thought, no sugarcoating involved."
  },
  {
    "word": "fortify",
    "definition": "to strengthen or reinforce",
    "sentence": "A good breakfast can fortify you for the day ahead, especially if that day includes a math test."
  },
  {
    "word": "fortunate",
    "definition": "having good luck; favorable",
    "sentence": "We were fortunate that the rain stopped just in time for the outdoor ceremony to begin."
  },
  {
    "word": "fracas",
    "definition": "a noisy disturbance or brawl",
    "sentence": "A fracas broke out in the hallway over who was next in line for the water fountain."
  },
  {
    "word": "fractious",
    "definition": "troublesome or irritable",
    "sentence": "The fractious committee couldn't agree on anything, including whether to continue meeting."
  },
  {
    "word": "fragile",
    "definition": "easily broken or damaged; delicate",
    "sentence": "The fragile ornament survived three moves but was finally defeated by a curious toddler."
  },
  {
    "word": "fragment",
    "definition": "a small piece broken off from something",
    "sentence": "Only a fragment of the original painting survived the flood, but it was enough to reveal its beauty."
  },
  {
    "word": "fragrant",
    "definition": "having a pleasant and sweet smell",
    "sentence": "The fragrant garden attracted every butterfly and bee in the neighborhood."
  },
  {
    "word": "frank",
    "definition": "open, honest, and direct in speech",
    "sentence": "I'll be frank with you—that outfit is bold, and not everyone could pull it off, but you absolutely can."
  },
  {
    "word": "frantic",
    "definition": "wild with fear, anxiety, or hurry",
    "sentence": "The frantic search for the lost car keys ended when they were found in the refrigerator."
  },
  {
    "word": "fraternity",
    "definition": "a group sharing common interests; brotherhood",
    "sentence": "The fraternity of musicians bonded over their shared love of jazz and terrible puns."
  },
  {
    "word": "fraudulent",
    "definition": "obtained through deception or dishonesty",
    "sentence": "The fraudulent website looked legitimate until you noticed the CEO's name was 'Definitely Real Person.'"
  },
  {
    "word": "fray",
    "definition": "a fight or conflict; to wear away by rubbing",
    "sentence": "After years of use, the beloved blanket began to fray at the edges but was loved no less."
  },
  {
    "word": "frenetic",
    "definition": "frenzied, hectic, frantic",
    "sentence": "The frenetic energy of New Year's Eve gives way to the very still energy of January 2nd."
  },
  {
    "word": "frigid",
    "definition": "extremely cold in temperature or manner",
    "sentence": "The frigid wind cut through every layer of clothing like it was on a personal mission."
  },
  {
    "word": "frivolous",
    "definition": "of little importance, trifling",
    "sentence": "Spending three hundred dollars on a gold-plated phone case seemed frivolous even to the person buying it."
  },
  {
    "word": "frugal",
    "definition": "thrifty, economical",
    "sentence": "My frugal grandmother reused wrapping paper so many times it was practically transparent."
  },
  {
    "word": "fruitful",
    "definition": "producing good or helpful results; productive",
    "sentence": "The fruitful brainstorming session produced twenty great ideas and one really weird one about trained pigeons."
  },
  {
    "word": "frustrate",
    "definition": "to prevent from accomplishing a purpose",
    "sentence": "Traffic jams frustrate even the most patient drivers, turning saints into horn-honking maniacs."
  },
  {
    "word": "fugitive",
    "definition": "a person who has escaped from confinement",
    "sentence": "The fugitive was caught hiding in the one place nobody thought to look—a library."
  },
  {
    "word": "fulcrum",
    "definition": "the pivot point on which a lever rests",
    "sentence": "The playground seesaw needs a fulcrum in the middle, or it's just a very disappointing plank."
  },
  {
    "word": "fulminate",
    "definition": "to express vehement protest or criticism",
    "sentence": "The columnist fulminated against the new parking regulations with impressive vocabulary and visible rage."
  },
  {
    "word": "fundamental",
    "definition": "forming a necessary base or core; essential",
    "sentence": "Understanding the fundamental rules of grammar makes all other writing skills much easier to learn."
  },
  {
    "word": "futile",
    "definition": "pointless and incapable of producing results",
    "sentence": "Arguing with a toddler is utterly futile—they have more stamina and fewer inhibitions than you do."
  },
  {
    "word": "gainsay",
    "definition": "to deny or contradict",
    "sentence": "Nobody could gainsay her achievement after she broke the school record by a full three seconds."
  },
  {
    "word": "gallant",
    "definition": "brave, heroic, and chivalrous",
    "sentence": "The gallant stranger helped the elderly woman carry her groceries all the way to her door."
  },
  {
    "word": "garrulous",
    "definition": "talkative, wordy",
    "sentence": "The garrulous taxi driver shared his entire life story during a fifteen-minute ride."
  },
  {
    "word": "gaudy",
    "definition": "showy and tasteless; extravagantly bright",
    "sentence": "The gaudy holiday sweater featured blinking lights, tinsel fringe, and a 3D reindeer nose."
  },
  {
    "word": "genial",
    "definition": "friendly, affable",
    "sentence": "The genial host made every guest feel like the most important person at the party."
  },
  {
    "word": "genteel",
    "definition": "polite and refined in manner",
    "sentence": "The genteel woman sipped her tea with a pinky raised and opinions carefully measured."
  },
  {
    "word": "genuine",
    "definition": "truly what it is said to be; authentic",
    "sentence": "His genuine concern for his classmates made him the person everyone trusted with their problems."
  },
  {
    "word": "germane",
    "definition": "relevant and appropriate to the subject",
    "sentence": "Please keep your comments germane to the topic—we can discuss your vacation photos after class."
  },
  {
    "word": "gibe",
    "definition": "a mocking or taunting remark",
    "sentence": "His gibe about her singing was meant as a joke, but it stung more than he realized."
  },
  {
    "word": "glib",
    "definition": "fluent and smooth-talking but insincere",
    "sentence": "The politician's glib response showed he hadn't actually understood the seriousness of the question."
  },
  {
    "word": "gloomy",
    "definition": "dark and depressing; pessimistic",
    "sentence": "The gloomy weather matched my mood perfectly, which was oddly comforting."
  },
  {
    "word": "glut",
    "definition": "an excessive supply or overabundance",
    "sentence": "A glut of streaming services means more choices but also more time spent deciding what to watch."
  },
  {
    "word": "grandiose",
    "definition": "on a magnificent or exaggerated scale",
    "sentence": "His grandiose plan to build a treehouse with an elevator was impressive on paper but impossible in practice."
  },
  {
    "word": "gratify",
    "definition": "to give pleasure or satisfaction to",
    "sentence": "It gratified her enormously to see her former student win the national science competition."
  },
  {
    "word": "gratuitous",
    "definition": "uncalled for, unwarranted",
    "sentence": "The movie had so much gratuitous slow motion that a two-hour film felt like four."
  },
  {
    "word": "gregarious",
    "definition": "drawn to the company of others, sociable",
    "sentence": "The gregarious student knew everyone's name by the end of the first week of school."
  },
  {
    "word": "grievance",
    "definition": "an official complaint about unfair treatment",
    "sentence": "The employees filed a formal grievance about the coffee machine being replaced with a hot water dispenser."
  },
  {
    "word": "grim",
    "definition": "forbidding and uninviting; harsh and serious",
    "sentence": "The weather report was grim: five straight days of rain and temperatures that felt like punishment."
  },
  {
    "word": "grotesque",
    "definition": "comically or repulsively ugly or distorted",
    "sentence": "The Halloween mask was so grotesque that even the person wearing it was a little scared of it."
  },
  {
    "word": "grouse",
    "definition": "to complain or grumble about something",
    "sentence": "Coworkers love to grouse about meetings that could have been emails."
  },
  {
    "word": "guile",
    "definition": "deceitful, cunning, sly behavior",
    "sentence": "The con artist used guile rather than force, charming people out of their money with a smile."
  },
  {
    "word": "gullible",
    "definition": "easily persuaded to believe something; naive",
    "sentence": "If you believe that gullible isn't in the dictionary, then you're proving the word's definition."
  },
  {
    "word": "haggard",
    "definition": "looking exhausted and unwell from suffering",
    "sentence": "After three all-nighters in a row, he looked so haggard that his friends asked if he was feeling okay."
  },
  {
    "word": "hamper",
    "definition": "to hinder or obstruct progress",
    "sentence": "The heavy rain hampered their progress, turning a short hike into an all-day muddy adventure."
  },
  {
    "word": "haphazard",
    "definition": "lacking any plan, order, or direction",
    "sentence": "His haphazard approach to packing meant he had four jackets but no underwear for the trip."
  },
  {
    "word": "hardy",
    "definition": "robust, capable of surviving through adverse conditions",
    "sentence": "The hardy plants survived the frost that wiped out everything else in the garden."
  },
  {
    "word": "harrowing",
    "definition": "greatly distressing, vexing",
    "sentence": "The harrowing documentary about mountain climbing made my palms sweat just from watching."
  },
  {
    "word": "haughty",
    "definition": "disdainfully proud",
    "sentence": "The haughty waiter looked at our casual clothes as if we had personally offended the restaurant."
  },
  {
    "word": "hazard",
    "definition": "a danger or risk",
    "sentence": "Wet floors are a slip hazard, which is why those yellow warning signs exist—and are routinely ignored."
  },
  {
    "word": "heed",
    "definition": "to pay careful attention to",
    "sentence": "She should have heeded the warning not to press the big red button, but curiosity won."
  },
  {
    "word": "heinous",
    "definition": "shockingly wicked, repugnant",
    "sentence": "Stealing someone's clearly labeled lunch from the office fridge is a heinous crime against coworkers everywhere."
  },
  {
    "word": "herald",
    "definition": "to signal the approach of; to announce",
    "sentence": "The first robin of spring heralded the end of winter and the beginning of allergy season."
  },
  {
    "word": "heresy",
    "definition": "belief contrary to accepted doctrine",
    "sentence": "Suggesting that tea is better than coffee is heresy in our household."
  },
  {
    "word": "hermetic",
    "definition": "completely sealed; airtight",
    "sentence": "The hermetic seal on the jar kept the cookies fresh for weeks, though they never lasted that long."
  },
  {
    "word": "heterogeneous",
    "definition": "varied, diverse in character",
    "sentence": "The heterogeneous student body included artists, athletes, scientists, and people who were somehow all three."
  },
  {
    "word": "heuristic",
    "definition": "enabling discovery through trial and error",
    "sentence": "Trial and error is a heuristic approach that works great for cooking but less well for chemistry experiments."
  },
  {
    "word": "hinder",
    "definition": "to create difficulty or delay for",
    "sentence": "Heavy backpacks can actually hinder learning by making students too uncomfortable to focus."
  },
  {
    "word": "hindrance",
    "definition": "something that provides obstruction or delay",
    "sentence": "Poor internet connection is the biggest hindrance to remote learning, followed closely by pets walking across keyboards."
  },
  {
    "word": "histrionic",
    "definition": "overly dramatic or theatrical in behavior",
    "sentence": "Her histrionic reaction to a paper cut—complete with dramatic gasping—deserved an Oscar nomination."
  },
  {
    "word": "homage",
    "definition": "special honor or respect shown publicly",
    "sentence": "The new restaurant paid homage to the classic diner, complete with checkered floors and milkshakes."
  },
  {
    "word": "homogeneous",
    "definition": "of the same kind; uniform throughout",
    "sentence": "The homogeneous mixture looked like one smooth liquid, hiding the five ingredients blended inside."
  },
  {
    "word": "honed",
    "definition": "sharpened or refined to perfection",
    "sentence": "Years of practice honed her skills until she could play the sonata from memory with her eyes closed."
  },
  {
    "word": "hostile",
    "definition": "unfriendly and antagonistic",
    "sentence": "The hostile weather forced us to abandon the hike and retreat to the much friendlier indoors."
  },
  {
    "word": "hubris",
    "definition": "excessive pride or self-confidence; arrogance",
    "sentence": "His hubris about never needing to study was dramatically corrected by the first midterm exam."
  },
  {
    "word": "humane",
    "definition": "showing compassion and benevolence",
    "sentence": "The shelter's humane treatment of animals included daily walks, quality food, and plenty of belly rubs."
  },
  {
    "word": "humdrum",
    "definition": "lacking excitement or variety; dull",
    "sentence": "The humdrum routine of weekday mornings was broken when a family of raccoons moved into the garage."
  },
  {
    "word": "hypocrisy",
    "definition": "pretending to believe what one does not",
    "sentence": "Telling kids not to eat junk food while snacking on chips is hypocrisy at its most relatable."
  },
  {
    "word": "hypothesis",
    "definition": "a proposed explanation to be tested",
    "sentence": "Her hypothesis that plants grow faster with music was tested with classical, rock, and absolute silence."
  },
  {
    "word": "iconoclast",
    "definition": "one who attacks common beliefs or institutions",
    "sentence": "The young iconoclast challenged every tradition the school had, starting with the outdated dress code."
  },
  {
    "word": "idealize",
    "definition": "to regard as perfect or better than reality",
    "sentence": "We tend to idealize the past, forgetting that 'the good old days' had plenty of bad days too."
  },
  {
    "word": "idiosyncrasy",
    "definition": "a distinctive or peculiar individual trait",
    "sentence": "His idiosyncrasy of always eating dessert first made him weird at restaurants but happy at every meal."
  },
  {
    "word": "idle",
    "definition": "not active or in use; lazy",
    "sentence": "An idle afternoon with nothing to do can be the most restful or the most boring thing in the world."
  },
  {
    "word": "ignoble",
    "definition": "not honorable in character or purpose",
    "sentence": "Blaming your teammate for a loss you caused is an ignoble move that fools nobody."
  },
  {
    "word": "ignorant",
    "definition": "lacking knowledge or awareness",
    "sentence": "Being ignorant about a topic isn't shameful—staying ignorant after having the chance to learn is."
  },
  {
    "word": "illicit",
    "definition": "forbidden, not permitted",
    "sentence": "The illicit candy trade that operated out of lockers was the school's worst-kept secret."
  },
  {
    "word": "illuminate",
    "definition": "to light up or make clearer",
    "sentence": "One good example can illuminate a confusing concept better than an hour of lecturing."
  },
  {
    "word": "illusive",
    "definition": "deceptive; based on illusion",
    "sentence": "The illusive perfect parking spot appeared just as we were about to give up and walk."
  },
  {
    "word": "immutable",
    "definition": "not changeable",
    "sentence": "The laws of physics are immutable, no matter how much you wish gravity would take a day off."
  },
  {
    "word": "impair",
    "definition": "to weaken or damage something",
    "sentence": "Staring at screens all day can impair your vision and your ability to have a conversation without checking your phone."
  },
  {
    "word": "impartial",
    "definition": "treating all rivals equally; unbiased",
    "sentence": "A good judge must remain impartial, regardless of personal feelings about either side."
  },
  {
    "word": "impassioned",
    "definition": "filled with or showing great emotion",
    "sentence": "Her impassioned plea for the stray animals moved the city council to fund a new shelter."
  },
  {
    "word": "impede",
    "definition": "to delay or prevent by obstructing",
    "sentence": "The fallen tree impeded traffic for hours, creating a backup visible from space—almost."
  },
  {
    "word": "impenetrable",
    "definition": "impossible to pass through or understand",
    "sentence": "The textbook's impenetrable prose required reading each sentence three times to extract any meaning."
  },
  {
    "word": "imperative",
    "definition": "necessary, pressing; a rule, command, or order",
    "sentence": "It's imperative that you save your work frequently, unless you enjoy retyping entire essays from memory."
  },
  {
    "word": "imperceptible",
    "definition": "so slight as to be almost impossible to notice",
    "sentence": "The changes were so imperceptible that nobody noticed the wallpaper was a slightly different shade of blue."
  },
  {
    "word": "imperial",
    "definition": "relating to an empire; majestic and commanding",
    "sentence": "The imperial palace was so massive that visitors needed a map and comfortable shoes to explore it."
  },
  {
    "word": "impertinent",
    "definition": "rude, insolent",
    "sentence": "The impertinent student asked the principal why he didn't have to follow the same dress code."
  },
  {
    "word": "implacable",
    "definition": "incapable of being appeased or mitigated",
    "sentence": "The implacable teacher never accepted late work, no matter how creative the excuse."
  },
  {
    "word": "implement",
    "definition": "an instrument, utensil, tool",
    "sentence": "The school decided to implement a new reading program after test scores dipped for the third year."
  },
  {
    "word": "implicate",
    "definition": "to involve in an incriminating way, incriminate",
    "sentence": "The security footage implicated the person who swore they had nothing to do with the missing donuts."
  },
  {
    "word": "implicit",
    "definition": "understood but not outwardly obvious, implied",
    "sentence": "There was an implicit understanding that whoever finished the milk had to buy more."
  },
  {
    "word": "implore",
    "definition": "to beg desperately for something",
    "sentence": "I implore you to try the chocolate cake—your taste buds will thank you for the rest of the week."
  },
  {
    "word": "impose",
    "definition": "to force something unwelcome on someone",
    "sentence": "Good neighbors don't impose their music taste on the entire building at midnight."
  },
  {
    "word": "imposing",
    "definition": "grand and impressive in appearance",
    "sentence": "The imposing castle on the hilltop looked like it had been pulled straight from a fairy tale."
  },
  {
    "word": "impotent",
    "definition": "lacking power or ability; helpless",
    "sentence": "The committee felt impotent to change the policy without support from the administration."
  },
  {
    "word": "impoverish",
    "definition": "to make poor; to deplete in quality",
    "sentence": "War and corruption can impoverish entire nations, leaving generations struggling to rebuild."
  },
  {
    "word": "impractical",
    "definition": "not sensible or realistic",
    "sentence": "White carpet in a house with three dogs and two kids is charmingly impractical."
  },
  {
    "word": "imprecise",
    "definition": "lacking exactness or accuracy",
    "sentence": "The imprecise directions of 'turn left somewhere near the big tree' got us hopelessly lost."
  },
  {
    "word": "impromptu",
    "definition": "done without being planned or rehearsed",
    "sentence": "The impromptu dance party in the kitchen started when her favorite song came on the radio."
  },
  {
    "word": "improve",
    "definition": "to make or become better",
    "sentence": "You don't have to be perfect—you just have to improve a little bit every single day."
  },
  {
    "word": "improvise",
    "definition": "to create or perform spontaneously",
    "sentence": "When the teleprompter broke, she had to improvise her entire acceptance speech, and it was the best one of the night."
  },
  {
    "word": "imprudent",
    "definition": "not showing care for consequences; rash",
    "sentence": "It was imprudent to spend the entire budget on decorations and leave nothing for actual food."
  },
  {
    "word": "impugn",
    "definition": "to challenge the truth or integrity of",
    "sentence": "Before you impugn someone's character, make sure you have facts and not just gossip."
  },
  {
    "word": "inane",
    "definition": "silly and meaningless",
    "sentence": "The inane reality show somehow became the most-watched program on television, which says a lot about television."
  }
]